[{
  "name": "East Palisades Trail",
  "allTrailsURI": "/trail/us/georgia/east-palisades-trail",
  "overview": "East Palisades Trail is a 2.6 mile heavily trafficked loop trail located near Atlanta, Georgia that features a river and is rated as moderate. The trail is primarily used for hiking, walking, and running and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.6 mi",
  "elevationGain": "305 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Island Ford Trail",
  "allTrailsURI": "/trail/us/georgia/island-ford-trail",
  "overview": "Island Ford Trail is a 5.4 mile heavily trafficked loop trail located near Atlanta, Georgia that features a waterfall and is rated as moderate. The trail is primarily used for hiking, running, and nature trips and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "5.4 mi",
  "elevationGain": "629 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "West Palisades Trail",
  "allTrailsURI": "/trail/us/georgia/west-palisades-trail",
  "overview": "West Palisades Trail is a 4.1 mile heavily trafficked loop trail located near Atlanta, Georgia that features a river and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.1 mi",
  "elevationGain": "672 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Cochran Shoals Trail from Interstate North Trailhead",
  "allTrailsURI": "/trail/us/georgia/cochran-shoals-trail-from-interstate-north-trailhead",
  "overview": "Cochran Shoals Trail from Interstate North Trailhead is a 6 mile heavily trafficked loop trail located near Atlanta, Georgia that features a river and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail.",
  "length": "6.0 mi",
  "elevationGain": "331 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lullwater Loop",
  "allTrailsURI": "/trail/us/georgia/lullwater-loop",
  "overview": "Lullwater Loop  is a 3.8 mile heavily trafficked loop trail located near Atlanta, Georgia that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is best used from April until September.",
  "length": "3.8 mi",
  "elevationGain": "252 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Cascade Springs Nature Preserve Outer Loop",
  "allTrailsURI": "/trail/us/georgia/cascade-springs-nature-preserve-outer-loop",
  "overview": "Cascade Springs Nature Preserve Outer Loop is a 2.6 mile moderately trafficked loop trail located near Atlanta, Georgia that features a river and is good for all skill levels. The trail is primarily used for hiking, walking, running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.6 mi",
  "elevationGain": "160 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Piedmont Park Loop",
  "allTrailsURI": "/trail/us/georgia/piedmont-park-loop",
  "overview": "Piedmont Park Loop is a 2.4 mile heavily trafficked loop trail located near Atlanta, Georgia that features a lake and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.4 mi",
  "elevationGain": "82 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Bob Callan Trail",
  "allTrailsURI": "/trail/us/georgia/bob-callan-trail",
  "overview": "Bob Callan Trail is a 3.9 mile moderately trafficked out and back trail located near Atlanta, Georgia that features a river and is good for all skill levels. The trail offers a number of activity options and is best used from April until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.9 mi",
  "elevationGain": "200 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Big Trees Forest Preserve",
  "allTrailsURI": "/trail/us/georgia/big-trees-forest-preserve",
  "overview": "Big Trees Forest Preserve is a 1 mile moderately trafficked loop trail located near Atlanta, Georgia that features a river and is good for all skill levels. The trail is primarily used for walking and nature trips and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.0 mi",
  "elevationGain": "147 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Murphey Candler Park Trail",
  "allTrailsURI": "/trail/us/georgia/murphey-candler-park-trail",
  "overview": "Murphey Candler Park Trail is a 1.5 mile moderately trafficked loop trail located near Atlanta, Georgia that features a lake and is good for all skill levels. The trail offers a number of activity options and is best used from March until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.5 mi",
  "elevationGain": "45 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Wilburn Farm and Cascade Trails Loop",
  "allTrailsURI": "/trail/us/georgia/wilburn-farm-and-cascade-trails-loop",
  "overview": "Wilburn Farm and Cascade Trails Loop is a 3.4 mile lightly trafficked loop trail located near Atlanta, Georgia that features a river and is rated as moderate. The trail is primarily used for hiking, walking, and nature trips and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.4 mi",
  "elevationGain": "377 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "BeltLine Eastside Trail From Piedmont Park",
  "allTrailsURI": "/trail/us/georgia/beltline-eastside-trail-from-piedmont-park",
  "overview": "BeltLine Eastside Trail From Piedmont Park is a 7 mile heavily trafficked out and back trail located near Atlanta, Georgia that features a great forest setting and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "7.0 mi",
  "elevationGain": "374 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "East Palisades",
  "allTrailsURI": "/trail/us/georgia/east-palisades--2",
  "overview": "East Palisades is a 1.3 mile moderately trafficked out and back trail located near Atlanta, Georgia that offers scenic views and is rated as moderate. The trail is primarily used for hiking, walking, running, and nature trips and is best used from April until October.",
  "length": "1.3 mi",
  "elevationGain": "154 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Elwyn John Wildlife Sanctuary",
  "allTrailsURI": "/trail/us/georgia/elwyn-john-wildlife-sanctuary--2",
  "overview": "Elwyn John Wildlife Sanctuary is a 1.7 mile lightly trafficked loop trail located near Atlanta, Georgia that features a waterfall and is good for all skill levels. The trail is primarily used for hiking, walking, and birding and is accessible year-round.",
  "length": "1.7 mi",
  "elevationGain": "177 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Chastain Park Trail",
  "allTrailsURI": "/trail/us/georgia/chastain-park-trail",
  "overview": "Chastain Park Trail  is a 2.5 mile lightly trafficked loop trail located near Atlanta, Georgia that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.5 mi",
  "elevationGain": "209 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Atlanta BeltLine Westside Trail",
  "allTrailsURI": "/trail/us/georgia/atlanta-beltline-westside-trail",
  "overview": "Atlanta BeltLine Westside Trail is a 3.2 mile moderately trafficked point-to-point trail located near Atlanta, Georgia that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.2 mi",
  "elevationGain": "108 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Historic Oakland Cemetery",
  "allTrailsURI": "/trail/us/georgia/historic-oakland-cemetery",
  "overview": "Historic Oakland Cemetery is a 0.8 mile loop trail located near Atlanta, Georgia that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for walking and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "0.8 mi",
  "elevationGain": "45 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Blueway Trail",
  "allTrailsURI": "/trail/us/georgia/blueway-trail",
  "overview": "Blueway Trail is a 3 mile moderately trafficked loop trail located near Atlanta, Georgia that features a lake and is good for all skill levels. The trail is primarily used for hiking, walking, nature trips, and bird watching and is accessible year-round.",
  "length": "3.0 mi",
  "elevationGain": "49 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Freedom Path",
  "allTrailsURI": "/trail/us/georgia/freedom-path",
  "overview": "Freedom Path  is a 8 mile heavily trafficked out and back trail located near Atlanta, Georgia that offers scenic views and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "8.0 mi",
  "elevationGain": "495 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Carter Center Freedom Park Olmsted Linear Parks",
  "allTrailsURI": "/trail/us/georgia/carter-center-freedom-park-olmsted-linear-parks",
  "overview": "Carter Center, Freedom Park, Olmsted Linear Parks is a 4.2 mile moderately trafficked loop trail located near Atlanta, Georgia that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for walking, trail running, birding, and road biking and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.2 mi",
  "elevationGain": "288 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Beltline Northside Trail",
  "allTrailsURI": "/trail/us/georgia/beltline-northside-trail",
  "overview": "Beltline Northside Trail is a 2.2 mile lightly trafficked out and back trail located near Atlanta, Georgia that offers scenic views and is good for all skill levels. The trail is primarily used for hiking, walking, running, and mountain biking.",
  "length": "2.2 mi",
  "elevationGain": "52 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Brook Run Park Loop",
  "allTrailsURI": "/trail/us/georgia/brook-run-park-loop",
  "overview": "Brook Run Park Loop is a 1.8 mile moderately trafficked loop trail located near Atlanta, Georgia and is good for all skill levels. The trail is primarily used for hiking, trail running, and road biking and is accessible year-round. Dogs are also able to use this trail.",
  "length": "1.8 mi",
  "elevationGain": "114 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Dunwoody Nature Trail",
  "allTrailsURI": "/trail/us/georgia/dunwoody-nature-trail",
  "overview": "Dunwoody Nature Trail  is a 1 mile moderately trafficked loop trail located near Atlanta, Georgia that offers the chance to see wildlife and is good for all skill levels. The trail is primarily used for hiking, walking, running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.0 mi",
  "elevationGain": "114 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Grant Park Loop Trail",
  "allTrailsURI": "/trail/us/georgia/grant-park-loop-trail",
  "overview": "Grant Park Loop Trail is a 1.4 mile moderately trafficked loop trail located near Atlanta, Georgia that features a great forest setting and is good for all skill levels. The trail is primarily used for hiking, walking, trail running, and nature trips and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.4 mi",
  "elevationGain": "95 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 1,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Riverplace Nature Trail",
  "allTrailsURI": "/trail/us/texas/riverplace-nature-trail",
  "overview": "Riverplace Nature Trail is a 5.5 mile heavily trafficked out and back trail located near Austin, Texas that features a waterfall and is rated as difficult. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "5.5 mi",
  "elevationGain": "823 ft",
  "routeType": "Out & Back",
  "difficulty": "hard",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Twin Falls and Sculpture Falls Via Barton Creek Greenbelt Trail",
  "allTrailsURI": "/trail/us/texas/barton-creek-from-camp-craft-road-entrance-to-twin-falls-trail",
  "overview": "Twin Falls and Sculpture Falls Via Barton Creek Greenbelt Trail is a 3.3 mile heavily trafficked out and back trail located near Austin, Texas that features a river and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.3 mi",
  "elevationGain": "127 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Barton Creek Greenbelt Trail",
  "allTrailsURI": "/trail/us/texas/barton-creek-greenbelt",
  "overview": "Barton Creek Greenbelt Trail is a 13.8 mile heavily trafficked out and back trail located near Austin, Texas that features a waterfall and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail.",
  "length": "13.8 mi",
  "elevationGain": "606 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lady Bird Lake Trail",
  "allTrailsURI": "/trail/us/texas/lady-bird-lake-trail",
  "overview": "Lady Bird Lake Trail is a 10 mile heavily trafficked loop trail located near Austin, Texas that features a river and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "10.0 mi",
  "elevationGain": "216 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Turkey Creek Trail",
  "allTrailsURI": "/trail/us/texas/turkey-creek-trail",
  "overview": "Turkey Creek Trail is a 2.8 mile heavily trafficked out and back trail located near Austin, Texas that features a river and is rated as moderate. The trail is primarily used for hiking, running, fishing, and mountain biking and is accessible year-round. Dogs are also able to use this trail.",
  "length": "2.8 mi",
  "elevationGain": "206 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "St Edwards Green and Red Loop",
  "allTrailsURI": "/trail/us/texas/st-edwards-green-and-red-loop",
  "overview": "St. Edwards Green and Red Loop is a 2.7 mile heavily trafficked loop trail located near Austin, Texas that features a waterfall and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.7 mi",
  "elevationGain": "347 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Walnut Creek Trail",
  "allTrailsURI": "/trail/us/texas/walnut-creek",
  "overview": "Walnut Creek Trail is a 1.3 mile heavily trafficked loop trail located near Austin, Texas that features a river and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail.",
  "length": "1.3 mi",
  "elevationGain": "62 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Great Hills Park Trail",
  "allTrailsURI": "/trail/us/texas/great-hills-park-trail",
  "overview": "Great Hills Park Trail is a 2.3 mile loop trail located near Austin, Texas that features a river. The trail is good for all skill levels and primarily used for hiking, walking, and trail running. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.3 mi",
  "elevationGain": "127 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Onion Creek and Homestead Trail Loop",
  "allTrailsURI": "/trail/us/texas/onion-creek-and-homestead-trail-loop--2",
  "overview": "Onion Creek and Homestead Trail Loop is a 6.5 mile heavily trafficked loop trail located near Austin, Texas that features a waterfall and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "6.5 mi",
  "elevationGain": "387 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Hamilton Greenbelt",
  "allTrailsURI": "/trail/us/texas/hamilton-pool-nature-trail",
  "overview": "Hamilton Greenbelt is a 5.1 mile moderately trafficked out and back trail located near Austin, Texas that offers scenic views and is good for all skill levels. The trail is primarily used for hiking, walking, nature trips, and bird watching and is best used from April until September. Dogs are also able to use this trail but must be kept on leash.",
  "length": "5.1 mi",
  "elevationGain": "374 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Hill of Life via Barton Creek Greenbelt Trail",
  "allTrailsURI": "/trail/us/texas/hill-of-life-via-barton-creek-greenbelt-trail",
  "overview": "Hill of Life via Barton Creek Greenbelt Trail is a 3.1 mile heavily trafficked out and back trail located near Austin, Texas that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is best used from April until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.1 mi",
  "elevationGain": "328 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Bull Creek South to North",
  "allTrailsURI": "/trail/us/texas/bull-creek-park",
  "overview": "Bull Creek South to North is a 3.8 mile heavily trafficked out and back trail located near Austin, Texas that features a waterfall and is good for all skill levels. The trail is primarily used for hiking, running, nature trips, and mountain biking. Dogs are also able to use this trail.",
  "length": "3.8 mi",
  "elevationGain": "82 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mary Moore Searight Park Trail",
  "allTrailsURI": "/trail/us/texas/mary-moore-searight-park-trail",
  "overview": "Mary Moore Searight Park Trail is a 2.1 mile heavily trafficked loop trail located near Austin, Texas that features a river and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.1 mi",
  "elevationGain": "65 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Slaughter Creek Trail Loop",
  "allTrailsURI": "/trail/us/texas/slaughter-creek-trail-loop",
  "overview": "Slaughter Creek Trail Loop is a 4.9 mile heavily trafficked loop trail located near Austin, Texas that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Horses are also able to use this trail.",
  "length": "4.9 mi",
  "elevationGain": "209 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Violet Crown Trail Zilker Trailhead to Trailhead",
  "allTrailsURI": "/trail/us/texas/barton-creek-greenbelt-violet-crown-trail--3",
  "overview": "Violet Crown Trail: Zilker Trailhead to 360 Trailhead is a 3.7 mile heavily trafficked point-to-point trail located near Austin, Texas that features a river and is good for all skill levels. The trail is primarily used for walking and running. Dogs are also able to use this trail.",
  "length": "3.7 mi",
  "elevationGain": "282 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Violet Crown Trail Trailhead to Trailhead",
  "allTrailsURI": "/trail/us/texas/violet-crown-trail-360-trailhead-to-290-trailhead",
  "overview": "Violet Crown Trail: 360 Trailhead to 290 Trailhead is a 1.8 mile heavily trafficked point-to-point trail located near Austin, Texas that features a great forest setting and is good for all skill levels. The trail offers a number of activity options. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.8 mi",
  "elevationGain": "239 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mount Lakeway Trail",
  "allTrailsURI": "/trail/us/texas/mount-lakeway-trail",
  "overview": "Mount Lakeway Trail is a 4.3 mile heavily trafficked out and back trail located near Austin, Texas that offers the chance to see wildlife and is rated as moderate. The trail offers a number of activity options. Dogs are also able to use this trail.",
  "length": "4.3 mi",
  "elevationGain": "921 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Bull Creek Trail",
  "allTrailsURI": "/trail/us/texas/bull-creek-preserve",
  "overview": "Bull Creek Trail is a 4.4 mile heavily trafficked loop trail located near Austin, Texas that offers the chance to see wildlife and is rated as moderate. The trail offers a number of activity options and is accessible year-round.",
  "length": "4.4 mi",
  "elevationGain": "538 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Homestead Trail",
  "allTrailsURI": "/trail/us/texas/homestead-trail",
  "overview": "Homestead Trail is a 3.1 mile heavily trafficked loop trail located near Austin, Texas that features a waterfall and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.1 mi",
  "elevationGain": "157 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Barton Greenbelt Trail via Barton Creek Plaza",
  "allTrailsURI": "/trail/us/texas/barton-greenbelt-trail-via-barton-creek-plaza",
  "overview": "Barton Greenbelt Trail via Barton Creek Plaza is a 6.6 mile heavily trafficked out and back trail located near Austin, Texas that features a waterfall and is good for all skill levels. The trail is primarily used for hiking, walking, running, and nature trips and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "6.6 mi",
  "elevationGain": "380 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lake Austin Bridge Overlook",
  "allTrailsURI": "/trail/us/texas/lake-austin-360-bridge-overlook",
  "overview": "Lake Austin/360 Bridge Overlook is a 1.8 mile heavily trafficked out and back trail located near Austin, Texas that features a river and is rated as moderate. The trail is primarily used for hiking, walking, nature trips, and bird watching and is accessible year-round. Dogs are also able to use this trail.",
  "length": "1.8 mi",
  "elevationGain": "177 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Spicewood Valley Trail",
  "allTrailsURI": "/trail/us/texas/spicewood-valley-trail--2",
  "overview": "Spicewood Valley Trail is a 2.1 mile moderately trafficked out and back trail located near Austin, Texas that features a lake and is rated as moderate. The trail is primarily used for hiking, walking, and running and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.1 mi",
  "elevationGain": "127 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mount Bonnell Trail",
  "allTrailsURI": "/trail/us/texas/mount-bonnell-trail",
  "overview": "Mount Bonnell Trail is a 0.5 mile heavily trafficked loop trail located near Austin, Texas that features a river. The trail is rated as moderate and is primarily used for hiking, walking, and trail running. Dogs are also able to use this trail but must be kept on leash.",
  "length": "0.5 mi",
  "elevationGain": "39 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Trailhead Park Trail",
  "allTrailsURI": "/trail/us/texas/trailhead-park-trail",
  "overview": "Trailhead Park Trail is a 4.5 mile out and back trail located near Austin, Texas that offers the chance to see wildlife. The trail is good for all skill levels and primarily used for hiking, walking, and trail running. Dogs are also able to use this trail.",
  "length": "4.5 mi",
  "elevationGain": "364 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Tangle of Trail and Mark s Art Loop",
  "allTrailsURI": "/trail/us/texas/tangle-of-trail-and-marks-art-loop",
  "overview": "Tangle of Trail and Mark's Art Loop is a 2.8 mile moderately trafficked loop trail located near Austin, Texas that features a great forest setting and is good for all skill levels. The trail is primarily used for hiking, running, and mountain biking and is accessible year-round. Dogs are also able to use this trail.",
  "length": "2.8 mi",
  "elevationGain": "196 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Rough Hollow",
  "allTrailsURI": "/trail/us/texas/rough-hollow",
  "overview": "Rough Hollow is a 1.4 mile lightly trafficked loop trail located near Austin, Texas and is good for all skill levels. The trail is primarily used for hiking and walking. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.4 mi",
  "elevationGain": "134 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Pemberton Heights Loop",
  "allTrailsURI": "/trail/us/texas/pemberton-heights-loop",
  "overview": "Pemberton Heights Loop is a 2.4 mile lightly trafficked loop trail located near Austin, Texas that features a great forest setting and is good for all skill levels. The trail is primarily used for walking. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.4 mi",
  "elevationGain": "154 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Onion Creek Greenbelt Trail",
  "allTrailsURI": "/trail/us/texas/onion-creek-greenbelt-trail",
  "overview": "Onion Creek Greenbelt Trail is a 2.3 mile out and back trail located near Austin, Texas that features a great forest setting and is rated as moderate. The trail is primarily used for hiking, walking, trail running, and nature trips. Dogs are also able to use this trail.",
  "length": "2.3 mi",
  "elevationGain": "49 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Boggy Creek Greenbelt Trail",
  "allTrailsURI": "/trail/us/texas/boggy-creek-greenbelt-trail",
  "overview": "Boggy Creek Greenbelt Trail is a 1.7 mile lightly trafficked out and back trail located near Austin, Texas that offers scenic views and is good for all skill levels. The trail is primarily used for hiking, walking, nature trips, and birding and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.7 mi",
  "elevationGain": "39 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Sculpture Falls Loop",
  "allTrailsURI": "/trail/us/texas/sculpture-falls-loop",
  "overview": "Sculpture Falls Loop is a 4.2 mile lightly trafficked loop trail located near Austin, Texas that features a waterfall and is good for all skill levels. The trail is primarily used for hiking, running, and nature trips.",
  "length": "4.2 mi",
  "elevationGain": "597 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Greenway Primitive at Bee Cave Red Trail",
  "allTrailsURI": "/trail/us/texas/greenway-primitive-trails-red-trail",
  "overview": "Greenway Primitive at Bee Cave Red Trail is a 1.5 mile lightly trafficked loop trail located near Austin, Texas that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, bird watching, and mountain biking and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.5 mi",
  "elevationGain": "154 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lake Creek Trail",
  "allTrailsURI": "/trail/us/texas/lake-creek-trail",
  "overview": "Lake Creek Trail is a 2.6 mile lightly trafficked out and back trail located near Austin, Texas and is good for all skill levels. The trail is primarily used for hiking, running, nature trips, and bird watching. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.6 mi",
  "elevationGain": "32 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Yett Creek Loop",
  "allTrailsURI": "/trail/us/texas/yetti-creek-loop",
  "overview": "Yett Creek Loop is a 1.7 mile loop trail located near Austin, Texas and is rated as moderate. The trail is primarily used for hiking, walking, running, and nature trips.",
  "length": "1.7 mi",
  "elevationGain": "49 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Sunset Valley Loop",
  "allTrailsURI": "/trail/us/texas/sunset-valley-loop",
  "overview": "Sunset Valley Loop is a 1.7 mile moderately trafficked loop trail located near Austin, Texas that offers the chance to see wildlife and is good for all skill levels. The trail is primarily used for hiking, walking, and nature trips.",
  "length": "1.7 mi",
  "elevationGain": "49 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Live Oak Loop",
  "allTrailsURI": "/trail/us/texas/live-oak-loop",
  "overview": "Live Oak Loop is a 2.3 mile lightly trafficked loop trail located near Austin, Texas that features a great forest setting and is good for all skill levels. The trail is primarily used for hiking and walking. Dogs are also able to use this trail.",
  "length": "2.3 mi",
  "elevationGain": "134 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Woodland Trail to the Falls",
  "allTrailsURI": "/trail/us/texas/woodland-trail-to-the-falls",
  "overview": "Woodland Trail to the Falls is a 1.4 mile moderately trafficked loop trail located near Austin, Texas that features a waterfall and is rated as moderate. The trail is primarily used for hiking, nature trips, and bird watching.",
  "length": "1.4 mi",
  "elevationGain": "170 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Warbler Trail via Laurel Trail",
  "allTrailsURI": "/trail/us/texas/warbler-trail-via-laurel-trail",
  "overview": "Warbler Trail via Laurel Trail is a 1.1 mile moderately trafficked out and back trail located near Austin, Texas that features a waterfall and is good for all skill levels. The trail is primarily used for hiking, walking, nature trips, and bird watching.",
  "length": "1.1 mi",
  "elevationGain": "160 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "SW Trail",
  "allTrailsURI": "/trail/us/texas/45sw-trail",
  "overview": "45SW Trail is a 7.2 mile moderately trafficked out and back trail located near Austin, Texas that features a great forest setting and is good for all skill levels. The trail is primarily used for walking and road biking and is accessible year-round. Dogs are also able to use this trail.",
  "length": "7.2 mi",
  "elevationGain": "259 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Allen Park Trail",
  "allTrailsURI": "/trail/us/texas/allen-park-trail",
  "overview": "Allen Park Trail is a 0.7 mile moderately trafficked loop trail located near Austin, Texas that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round.",
  "length": "0.7 mi",
  "elevationGain": "101 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Bobcat Ridge Loop",
  "allTrailsURI": "/trail/us/texas/bobcat-ridge-loop",
  "overview": "Bobcat Ridge Loop is a 4.1 mile lightly trafficked loop trail located near Austin, Texas that features a river. The trail is good for all skill levels and is primarily used for hiking, walking, running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.1 mi",
  "elevationGain": "318 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Arroyo Vista and the Ledge Loop",
  "allTrailsURI": "/trail/us/texas/arroyo-vista-and-the-ledge-loop",
  "overview": "Arroyo Vista and the Ledge Loop is a 1 mile moderately trafficked loop trail located near Austin, Texas that features a great forest setting and is good for all skill levels. The trail is primarily used for hiking, walking, nature trips, and bird watching.",
  "length": "1.0 mi",
  "elevationGain": "95 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Valburn Switchback Party",
  "allTrailsURI": "/trail/us/texas/valburn-switchback-party",
  "overview": "Valburn Switchback Party is a 1.1 mile moderately trafficked loop trail located near Austin, Texas that offers scenic views and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.1 mi",
  "elevationGain": "203 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Bee Cave Park Loop",
  "allTrailsURI": "/trail/us/texas/bee-cave-park-loop",
  "overview": "Bee Cave Park Loop is a 1.4 mile moderately trafficked loop trail located near Austin, Texas and is good for all skill levels. The trail is primarily used for walking, trail running, and nature trips and is accessible year-round.",
  "length": "1.4 mi",
  "elevationGain": "59 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "West Bull Creek Greenbelt",
  "allTrailsURI": "/trail/us/texas/west-bull-creek-greenbelt",
  "overview": "West Bull Creek Greenbelt is a 4 mile lightly trafficked out and back trail located near Austin, Texas that offers the chance to see wildlife and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail.",
  "length": "4.0 mi",
  "elevationGain": "426 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 2,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Avalon Loop Trail",
  "allTrailsURI": "/trail/us/maryland/avalon-loop-trail",
  "overview": "Avalon Loop Trail is a 20 mile heavily trafficked loop trail located near Baltimore, Maryland that features a waterfall and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "20.0 mi",
  "elevationGain": "2,250 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 3,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lake Roland Park Red Trail",
  "allTrailsURI": "/trail/us/maryland/lake-roland-park-red-trail",
  "overview": "Lake Roland Park Red Trail  is a 2.7 mile moderately trafficked loop trail located near Baltimore, Maryland that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.7 mi",
  "elevationGain": "150 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 3,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Herring Run Greenway via Lake Montebello",
  "allTrailsURI": "/trail/us/maryland/lake-montebello-herring-run-park-trail",
  "overview": "Herring Run Greenway via Lake Montebello is a 5.7 mile moderately trafficked loop trail located near Baltimore, Maryland that features a lake and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "5.7 mi",
  "elevationGain": "196 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 3,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Stoney Run Walking Path",
  "allTrailsURI": "/trail/us/maryland/stoney-run-walking-path",
  "overview": "Stoney Run Walking Path is a 5.6 mile moderately trafficked out and back trail located near Baltimore, Maryland and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "5.6 mi",
  "elevationGain": "272 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 3,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Gwynns Falls Trail",
  "allTrailsURI": "/trail/us/maryland/gwynns-falls-trail",
  "overview": "Gwynns Falls Trail is a 4.1 mile lightly trafficked loop trail located near Baltimore, Maryland that features a waterfall and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.1 mi",
  "elevationGain": "180 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 3,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Leakin Park Loop Trail",
  "allTrailsURI": "/trail/us/maryland/leakin-park-trail",
  "overview": "Leakin Park Loop Trail is a 3.1 mile loop trail located near Baltimore, Maryland that features a great forest setting and is rated as moderate. The trail is primarily used for hiking, walking, and trail running and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.1 mi",
  "elevationGain": "387 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 3,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lake Montebello Loop",
  "allTrailsURI": "/trail/us/maryland/track-jul-09-0858-pm",
  "overview": "Lake Montebello Loop is a 1.4 mile moderately trafficked loop trail located near Baltimore, Maryland that offers scenic views and is good for all skill levels. The trail is primarily used for hiking, walking, nature trips, and road biking.",
  "length": "1.4 mi",
  "elevationGain": "19 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 3,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lake Roland Park Pink Trail",
  "allTrailsURI": "/trail/us/maryland/lake-roland-park-pink-trail",
  "overview": "Lake Roland Park Pink Trail is a 1.4 mile lightly trafficked out and back trail located near Baltimore, Maryland that features a great forest setting and is rated as moderate. The trail is primarily used for hiking, walking, nature trips, and bird watching and is best used from April until September. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.4 mi",
  "elevationGain": "82 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 3,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Fort McHenry Trail",
  "allTrailsURI": "/trail/us/maryland/fort-mchenry-trail",
  "overview": "Fort McHenry Trail is a 0.9 mile heavily trafficked loop trail located near Baltimore, Maryland that offers scenic views and is good for all skill levels. The trail is primarily used for hiking, walking, trail running, and road biking and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "0.9 mi",
  "elevationGain": "19 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 3,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Patterson Park Trail",
  "allTrailsURI": "/trail/us/maryland/patterson-park-trail",
  "overview": "Patterson Park Trail is a 1.6 mile loop trail located near Baltimore, Maryland that features a lake and is good for all skill levels. The trail is primarily used for walking, nature trips, and birding and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.6 mi",
  "elevationGain": "104 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 3,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Baltimore Waterfront Promenade Canton Waterfront Park to Fells Point",
  "allTrailsURI": "/trail/us/maryland/baltimore-waterfront-promenade-canton-waterfront-park-to-fells-point",
  "overview": "Baltimore Waterfront Promenade: Canton Waterfront Park to Fells Point is a 4.3 mile moderately trafficked out and back trail located near Baltimore, Maryland that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.3 mi",
  "elevationGain": "52 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 3,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Druid Hill Park Trail",
  "allTrailsURI": "/trail/us/maryland/druid-hill-park-trail",
  "overview": "Druid Hill Park Trail is a 6.4 mile loop trail located near Baltimore, Maryland that features a lake and is good for all skill levels. The trail is primarily used for hiking, walking, and mountain biking and is accessible year-round. Dogs are also able to use this trail.",
  "length": "6.4 mi",
  "elevationGain": "419 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 3,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Baltimore s Inner Harbor Walking Tour",
  "allTrailsURI": "/trail/us/maryland/baltimores-inner-harbor-walking-tour",
  "overview": "Baltimore's Inner Harbor Walking Tour is a 1.5 mile point-to-point trail located near Baltimore, Maryland and is good for all skill levels. The trail is primarily used for walking. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.5 mi",
  "elevationGain": "13 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 3,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Jones Falls Trail",
  "allTrailsURI": "/trail/us/maryland/jones-falls--2",
  "overview": "Jones Falls Trail is a 2.6 mile moderately trafficked out and back trail located near Baltimore, Maryland that offers scenic views and is good for all skill levels. The trail is primarily used for hiking, walking, nature trips, and road biking and is best used from March until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.6 mi",
  "elevationGain": "216 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 3,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Stack Rock Trail",
  "allTrailsURI": "/trail/us/idaho/stack-rock-trail",
  "overview": "Stack Rock Trail is a 10.9 mile heavily trafficked out and back trail located near Boise, Idaho that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking and horses and is best used from May until October. Dogs and horses are also able to use this trail.",
  "length": "10.9 mi",
  "elevationGain": "1,227 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Table Rock Trail",
  "allTrailsURI": "/trail/us/idaho/table-rock-trail",
  "overview": "Table Rock Trail is a 3.7 mile heavily trafficked loop trail located near Boise, Idaho that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is best used from March until November. Dogs and horses are also able to use this trail.",
  "length": "3.7 mi",
  "elevationGain": "895 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Hulls Gulch Nature Trail",
  "allTrailsURI": "/trail/us/idaho/hulls-gulch-nature-trail",
  "overview": "Hulls Gulch Nature Trail is a 6.3 mile heavily trafficked out and back trail located near Boise, Idaho that features a waterfall and is rated as moderate. The trail is primarily used for hiking, running, and mountain biking and is accessible year-round. Dogs are also able to use this trail.",
  "length": "6.3 mi",
  "elevationGain": "1,131 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Cervidae Peak",
  "allTrailsURI": "/trail/us/idaho/cervidae-peak",
  "overview": "Cervidae Peak is a 4.4 mile heavily trafficked out and back trail located near Boise, Idaho that features a lake and is rated as difficult. The trail is primarily used for hiking, running, and bird watching and is best used from March until October. Dogs are also able to use this trail.",
  "length": "4.4 mi",
  "elevationGain": "1,883 ft",
  "routeType": "Out & Back",
  "difficulty": "hard",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Adelmann Mine",
  "allTrailsURI": "/trail/us/idaho/adelmann-mine",
  "overview": "Adelmann Mine is a 4.7 mile moderately trafficked out and back trail located near Boise, Idaho that offers the chance to see wildlife and is rated as moderate. The trail offers a number of activity options and is best used from April until September. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.7 mi",
  "elevationGain": "1,322 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Polecat Loop Trail",
  "allTrailsURI": "/trail/us/idaho/polecat-loop-trail",
  "overview": "Polecat Loop Trail is a 6 mile heavily trafficked loop trail located near Boise, Idaho that offers the chance to see wildlife and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "6.0 mi",
  "elevationGain": "764 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Red Cliffs Nature Center Trail",
  "allTrailsURI": "/trail/us/idaho/red-cliffs-nature-center-trail",
  "overview": "Red Cliffs Nature Center Trail is a 3 mile heavily trafficked loop trail located near Boise, Idaho that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail.",
  "length": "3.0 mi",
  "elevationGain": "482 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mores Mountain Loop",
  "allTrailsURI": "/trail/us/idaho/mores-mountain-loop",
  "overview": "Mores Mountain Loop is a 1.9 mile moderately trafficked loop trail located near Boise, Idaho that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, running, nature trips, and mountain biking and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.9 mi",
  "elevationGain": "518 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Shafer Butte Loop via Brewer s Byway and Lodge Cat Track",
  "allTrailsURI": "/trail/us/idaho/shafer-butte-loop-via-brewers-byway-and-lodge-cat-track",
  "overview": "Shafer Butte Loop via Brewer's Byway and Lodge Cat Track is a 5.2 mile moderately trafficked loop trail located near Boise, Idaho that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is best used from June until October. Dogs are also able to use this trail.",
  "length": "5.2 mi",
  "elevationGain": "997 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Dry Creek Shingle Creek Loop",
  "allTrailsURI": "/trail/us/idaho/dry-creek-shingle-creek-loop",
  "overview": "Dry Creek - Shingle Creek Loop is a 13.8 mile moderately trafficked loop trail located near Boise, Idaho that features a great forest setting and is rated as difficult. The trail is primarily used for hiking, running, and backpacking. Dogs are also able to use this trail.",
  "length": "13.8 mi",
  "elevationGain": "2,221 ft",
  "routeType": "Loop",
  "difficulty": "hard",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Crestline Sidewinder Loop Trail",
  "allTrailsURI": "/trail/us/idaho/crestline-sidewinder-loop-trail",
  "overview": "Crestline Sidewinder Loop Trail is a 9.6 mile moderately trafficked loop trail located near Boise, Idaho that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is best used from March until October. Dogs are also able to use this trail.",
  "length": "9.6 mi",
  "elevationGain": "1,443 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Quail Harrison Hollows Loop",
  "allTrailsURI": "/trail/us/idaho/quail-harrison-hollows-loop",
  "overview": "Quail - Harrison Hollows Loop is a 4.1 mile moderately trafficked loop trail located near Boise, Idaho that offers the chance to see wildlife and is rated as moderate. The trail offers a number of activity options and is best used from March until October. Dogs are also able to use this trail.",
  "length": "4.1 mi",
  "elevationGain": "856 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Homestead Trail",
  "allTrailsURI": "/trail/us/idaho/homestead-trail",
  "overview": "Homestead Trail is a 4.2 mile moderately trafficked out and back trail located near Boise, Idaho that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is best used from March until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.2 mi",
  "elevationGain": "921 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Seamans Gulch Dry Creek Loop Trail",
  "allTrailsURI": "/trail/us/idaho/seamans-gulch-dry-creek-loop-trail",
  "overview": "Seamans Gulch Dry Creek Loop Trail is a 2.1 mile heavily trafficked loop trail located near Boise, Idaho that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs and horses are also able to use this trail.",
  "length": "2.1 mi",
  "elevationGain": "255 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Five Mile Gulch Watchman and Three Bears Loop",
  "allTrailsURI": "/trail/us/idaho/five-mile-gulch-watchman-three-bears-loop",
  "overview": "Five Mile Gulch, Watchman, and Three Bears Loop is a 6 mile moderately trafficked loop trail located near Boise, Idaho that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options. Dogs and horses are also able to use this trail.",
  "length": "6.0 mi",
  "elevationGain": "1,033 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Boise River Greenbelt Trail Ann Morrison Park to E Parkcenter Blvd",
  "allTrailsURI": "/trail/us/idaho/boise-river-greenbelt-trail-ann-morrison-park-to-e-parkcenter-blvd",
  "overview": "Boise River Greenbelt Trail: Ann Morrison Park to E Parkcenter Blvd is a 10.4 mile heavily trafficked out and back trail located near Boise, Idaho and is good for all skill levels. The trail offers a number of activity options. Dogs are also able to use this trail but must be kept on leash.",
  "length": "10.4 mi",
  "elevationGain": "98 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Kepros Mountain Trail",
  "allTrailsURI": "/trail/us/idaho/kepros-mountain-trail",
  "overview": "Kepros Mountain Trail is a 9.4 mile lightly trafficked out and back trail located near Boise, Idaho that offers the chance to see wildlife and is rated as difficult. The trail offers a number of activity options.",
  "length": "9.4 mi",
  "elevationGain": "1,988 ft",
  "routeType": "Out & Back",
  "difficulty": "hard",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Bucktail Shane s and the Central Ridge Trails",
  "allTrailsURI": "/trail/us/idaho/bucktail-shanes-and-the-central-ridge-trails",
  "overview": "Bucktail, Shane's, and the Central Ridge Trails is a 6.8 mile moderately trafficked loop trail located near Boise, Idaho that features a river and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs and horses are also able to use this trail.",
  "length": "6.8 mi",
  "elevationGain": "951 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Corrals Bob s Trail Loop",
  "allTrailsURI": "/trail/us/idaho/corrals-bobs-trail-loop",
  "overview": "Corrals - Bob's Trail Loop is a 8.6 mile moderately trafficked loop trail located near Boise, Idaho that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is best used from March until April. Dogs and horses are also able to use this trail.",
  "length": "8.6 mi",
  "elevationGain": "1,578 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mount Heinen",
  "allTrailsURI": "/trail/us/idaho/mount-heinen",
  "overview": "Mount Heinen is a 10.3 mile lightly trafficked out and back trail located near Boise, Idaho that features beautiful wild flowers and is rated as difficult. The trail is primarily used for hiking and is best used from May until September.",
  "length": "10.3 mi",
  "elevationGain": "3,795 ft",
  "routeType": "Out & Back",
  "difficulty": "hard",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lucky Peak Loop Trail",
  "allTrailsURI": "/trail/us/idaho/lucky-peak-loop-trail",
  "overview": "Lucky Peak Loop Trail is a 13.6 mile moderately trafficked loop trail located near Boise, Idaho that features beautiful wild flowers and is rated as difficult. The trail offers a number of activity options and is best used from March until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "13.6 mi",
  "elevationGain": "3,166 ft",
  "routeType": "Loop",
  "difficulty": "hard",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Freddy s Stack Rock Trail",
  "allTrailsURI": "/trail/us/idaho/freddys-stack-rock-trail",
  "overview": "Freddy's Stack Rock Trail is a 11.7 mile heavily trafficked out and back trail located near Boise, Idaho that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is best used from April until October. Dogs are also able to use this trail.",
  "length": "11.7 mi",
  "elevationGain": "1,335 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Kestrel Crestline and Lower Hulls Gulch Loop",
  "allTrailsURI": "/trail/us/idaho/kestrel-crestline-and-lower-hulls-gulch-loop",
  "overview": "Kestrel, Crestline, and Lower Hulls Gulch Loop is a 5.3 mile heavily trafficked loop trail located near Boise, Idaho that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for hiking, walking, running, and mountain biking.",
  "length": "5.3 mi",
  "elevationGain": "679 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Veterans Trail",
  "allTrailsURI": "/trail/us/idaho/veterans-trail",
  "overview": "Veterans Trail is a 2.3 mile moderately trafficked loop trail located near Boise, Idaho that offers scenic views. The trail is rated as moderate and is primarily used for hiking, walking, running, and nature trips. Dogs are also able to use this trail.",
  "length": "2.3 mi",
  "elevationGain": "367 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Three Bears Trail",
  "allTrailsURI": "/trail/us/idaho/three-bears-trail",
  "overview": "Three Bears Trail is a 9.4 mile moderately trafficked out and back trail located near Boise, Idaho that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking and mountain biking.",
  "length": "9.4 mi",
  "elevationGain": "1,896 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 4,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Boston s Freedom Trail",
  "allTrailsURI": "/trail/us/massachusetts/bostons-freedom-trail",
  "overview": "Boston's Freedom Trail is a 2.5 mile heavily trafficked point-to-point trail located near Boston, Massachusetts that features a river and is good for all skill levels. The trail is primarily used for hiking, walking, and running and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.5 mi",
  "elevationGain": "131 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 5,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Deer Island Trail",
  "allTrailsURI": "/trail/us/massachusetts/deer-island-trail",
  "overview": "Deer Island Trail is a 2.7 mile heavily trafficked loop trail located near Boston, Massachusetts that offers the chance to see wildlife and is good for all skill levels. The trail is primarily used for hiking, walking, and running and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.7 mi",
  "elevationGain": "59 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 5,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Neponset",
  "allTrailsURI": "/trail/us/massachusetts/neponset",
  "overview": "Neponset is a 3.2 mile moderately trafficked out and back trail located near Boston, Massachusetts that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for hiking, walking, nature trips, and birding and is best used from April until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.2 mi",
  "elevationGain": "82 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 5,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Public Garden Monument Walking Tour",
  "allTrailsURI": "/trail/us/massachusetts/public-garden-monument-walking-tour",
  "overview": "Public Garden Monument Walking Tour is a 1.1 mile moderately trafficked loop trail located near Boston, Massachusetts that features a lake and is good for all skill levels. The trail offers a number of activity options and is best used from April until October. Dogs are also able to use this trail.",
  "length": "1.1 mi",
  "elevationGain": "0 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 5,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Millenium Park",
  "allTrailsURI": "/trail/us/massachusetts/millenium-park",
  "overview": "Millenium Park is a 3.6 mile moderately trafficked loop trail located near Boston, Massachusetts that features a river and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.6 mi",
  "elevationGain": "160 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 5,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Jamaica Pond",
  "allTrailsURI": "/trail/us/massachusetts/jamaica-pond",
  "overview": "Jamaica Pond is a 1.5 mile moderately trafficked loop trail located near Boston, Massachusetts that offers scenic views and is good for all skill levels. The trail offers a number of activity options and is best used from April until October.",
  "length": "1.5 mi",
  "elevationGain": "45 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 5,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Boston s Emerald Necklace Trail",
  "allTrailsURI": "/trail/us/massachusetts/bostons-emerald-necklace-trail",
  "overview": "Boston's Emerald Necklace Trail is a 32.5 mile moderately trafficked loop trail located near Boston, Massachusetts that features a lake and is rated as moderate. The trail offers a number of activity options and is best used from April until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "32.5 mi",
  "elevationGain": "482 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 5,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Jamaica Pond and Victorian Jamaica Plain",
  "allTrailsURI": "/trail/us/massachusetts/jamaica-pond-and-victorian-jamaica-plain",
  "overview": "Jamaica Pond and Victorian Jamaica Plain is a 3.2 mile heavily trafficked loop trail located near Boston, Massachusetts that features a lake and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail.",
  "length": "3.2 mi",
  "elevationGain": "104 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 5,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Spectacle Island Perimeter Trail",
  "allTrailsURI": "/trail/us/massachusetts/spectacle-island-perimeter-trail",
  "overview": "Spectacle Island Perimeter Trail is a 1.9 mile heavily trafficked loop trail located near Boston, Massachusetts that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is best used from April until October.",
  "length": "1.9 mi",
  "elevationGain": "95 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 5,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Paul Revere Ride to Freedom Bike Tour",
  "allTrailsURI": "/trail/us/massachusetts/paul-revere-ride-to-freedom-bike-tour",
  "overview": "Paul Revere Ride to Freedom Bike Tour is a 45.8 mile moderately trafficked loop trail located near Boston, Massachusetts and is rated as moderate. The trail offers a number of activity options and is best used from April until September. Dogs are also able to use this trail but must be kept on leash.",
  "length": "45.8 mi",
  "elevationGain": "1,286 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 5,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Commonwealth Ave Monument Tour",
  "allTrailsURI": "/trail/us/massachusetts/commonwealth-ave-monument-tour",
  "overview": "Commonwealth Ave Monument Tour is a 2.2 mile moderately trafficked out and back trail located near Boston, Massachusetts that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is best used from March until October. Dogs are also able to use this trail.",
  "length": "2.2 mi",
  "elevationGain": "13 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 5,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Belle Isle Marsh",
  "allTrailsURI": "/trail/us/massachusetts/belle-isle-marsh",
  "overview": "Belle Isle Marsh is a 0.6 mile moderately trafficked loop trail located near Boston, Massachusetts that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for hiking, walking, nature trips, and bird watching and is accessible year-round. Dogs are also able to use this trail.",
  "length": "0.6 mi",
  "elevationGain": "3 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 5,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Dr Paul Dudley White Path",
  "allTrailsURI": "/trail/us/massachusetts/dr-paul-dudley-white-path",
  "overview": "Dr. Paul Dudley White Path is a 3.7 mile moderately trafficked loop trail located near Boston, Massachusetts that features a river. The trail is good for all skill levels and offers a number of activity options.",
  "length": "3.7 mi",
  "elevationGain": "29 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 5,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Exploring Boston s North End",
  "allTrailsURI": "/trail/us/massachusetts/exploring-bostons-north-end",
  "overview": "Exploring Boston's North End is a 4.8 mile moderately trafficked loop trail located near Boston, Massachusetts that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is best used from March until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.8 mi",
  "elevationGain": "85 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 5,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Boston City View Bike Route",
  "allTrailsURI": "/trail/us/massachusetts/boston-city-view-bike-route",
  "overview": "Boston City View Bike Route is a 10 mile moderately trafficked loop trail located near Boston, Massachusetts that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for hiking, walking, nature trips, and bird watching and is best used from March until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "10.0 mi",
  "elevationGain": "209 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 5,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "East Boston Greenway",
  "allTrailsURI": "/trail/us/massachusetts/east-boston-greenway",
  "overview": "East Boston Greenway is a 2.5 mile point-to-point trail located near Boston, Massachusetts and is good for all skill levels. The trail is primarily used for walking, running, and road biking.",
  "length": "2.5 mi",
  "elevationGain": "16 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 5,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Boston with Kids",
  "allTrailsURI": "/trail/us/massachusetts/boston-with-kids",
  "overview": "Boston with Kids is a 1.7 mile moderately trafficked point-to-point trail located near Boston, Massachusetts that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for walking, nature trips, and birding and is best used from March until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.7 mi",
  "elevationGain": "26 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 5,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Boston s Black Heritage Trail",
  "allTrailsURI": "/trail/us/massachusetts/boston-s-black-heritage-trail",
  "overview": "Boston's Black Heritage Trail is a 1.3 mile heavily trafficked point-to-point trail located near Boston, Massachusetts that offers scenic views and is good for all skill levels. The trail is primarily used for walking and running and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.3 mi",
  "elevationGain": "82 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 5,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Southwest Corridor Path",
  "allTrailsURI": "/trail/us/massachusetts/southwest-corridor-path",
  "overview": "Southwest Corridor Path is a 1.4 mile heavily trafficked out and back trail located near Boston, Massachusetts and is good for all skill levels. The trail is primarily used for walking and is accessible year-round. Dogs are also able to use this trail.",
  "length": "1.4 mi",
  "elevationGain": "6 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 5,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Royal Arch Trail",
  "allTrailsURI": "/trail/us/colorado/royal-arch-trail",
  "overview": "Royal Arch Trail is a 4 mile heavily trafficked out and back trail located near Boulder, Colorado that features beautiful wild flowers and is rated as difficult. The trail is primarily used for hiking, running, nature trips, and snowshoeing and is best used from March until October. Dogs are also able to use this trail.",
  "length": "4.0 mi",
  "elevationGain": "1,492 ft",
  "routeType": "Out & Back",
  "difficulty": "hard",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mount Sanitas and Sanitas Valley Loop Trail",
  "allTrailsURI": "/trail/us/colorado/mount-sanitas-and-sanitas-valley-loop-trail",
  "overview": "Mount Sanitas and Sanitas Valley Loop Trail is a 3.2 mile heavily trafficked loop trail located near Boulder, Colorado that features beautiful wild flowers and is rated as difficult. The trail is primarily used for hiking and running and is best used from April until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.2 mi",
  "elevationGain": "1,256 ft",
  "routeType": "Loop",
  "difficulty": "hard",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Chautauqua Trail",
  "allTrailsURI": "/trail/us/colorado/chautauqua-trail",
  "overview": "Chautauqua Trail is a 1.2 mile heavily trafficked out and back trail located near Boulder, Colorado that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, walking, running, and nature trips and is best used from March until November. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.2 mi",
  "elevationGain": "419 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "First and Second Flatirons Loop",
  "allTrailsURI": "/trail/us/colorado/first-and-second-flatiron-loop",
  "overview": "First and Second Flatirons Loop is a 2.5 mile heavily trafficked loop trail located near Boulder, Colorado that features beautiful wild flowers and is rated as difficult. The trail is primarily used for hiking and is best used from April until October. Dogs are also able to use this trail.",
  "length": "2.5 mi",
  "elevationGain": "1,440 ft",
  "routeType": "Loop",
  "difficulty": "hard",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Green Mountain West Trail",
  "allTrailsURI": "/trail/us/colorado/green-mountain-west-trail",
  "overview": "Green Mountain West Trail is a 4 mile heavily trafficked out and back trail located near Boulder, Colorado that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, running, nature trips, and bird watching and is best used from April until October. Dogs are also able to use this trail.",
  "length": "4.0 mi",
  "elevationGain": "721 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mallory Cave",
  "allTrailsURI": "/trail/us/colorado/mallory-cave",
  "overview": "Mallory Cave is a 2.4 mile heavily trafficked out and back trail located near Boulder, Colorado that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking and rock climbing and is best used from May until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.4 mi",
  "elevationGain": "803 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Bear Peak via the Shadow Canyon Trail",
  "allTrailsURI": "/trail/us/colorado/bear-peak-via-the-shadow-canyon-trail",
  "overview": "Bear Peak via Homestead and Shadow Canyon Trail is a 8.1 mile heavily trafficked out and back trail located near Boulder, Colorado that features beautiful wild flowers and is rated as difficult. The trail is primarily used for hiking, running, nature trips, and bird watching and is best used from April until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "8.1 mi",
  "elevationGain": "2,890 ft",
  "routeType": "Out & Back",
  "difficulty": "hard",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Walker Ranch Loop Trail",
  "allTrailsURI": "/trail/us/colorado/walker-ranch-loop",
  "overview": "Walker Ranch Loop Trail is a 8.3 mile heavily trafficked loop trail located near Boulder, Colorado that features a river and is rated as difficult. The trail offers a number of activity options and is best used from March until November. Dogs are also able to use this trail but must be kept on leash.",
  "length": "8.3 mi",
  "elevationGain": "1,650 ft",
  "routeType": "Loop",
  "difficulty": "hard",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Green Mountain Loop",
  "allTrailsURI": "/trail/us/colorado/green-mountain-loop",
  "overview": "Green Mountain Loop is a 7.2 mile heavily trafficked loop trail located near Boulder, Colorado that features beautiful wild flowers and is rated as difficult. The trail is primarily used for hiking and running and is best used from March until November.",
  "length": "7.2 mi",
  "elevationGain": "2,798 ft",
  "routeType": "Loop",
  "difficulty": "hard",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Gregory Canyon Range View and Flagstaff Trail Loop",
  "allTrailsURI": "/trail/us/colorado/gregory-canyon-range-view-and-flagstaff-trail-loop",
  "overview": "Gregory Canyon, Range View and Flagstaff Trail Loop is a 3.6 mile heavily trafficked loop trail located near Boulder, Colorado that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, running, rock climbing, and nature trips. Dogs are also able to use this trail.",
  "length": "3.6 mi",
  "elevationGain": "1,197 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lion s Lair Trail",
  "allTrailsURI": "/trail/us/colorado/lions-lair-trail",
  "overview": "Lion's Lair Trail is a 4.4 mile heavily trafficked out and back trail located near Boulder, Colorado that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for hiking, running, and nature trips.",
  "length": "4.4 mi",
  "elevationGain": "839 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Bear Peak via Shanahan Ridge",
  "allTrailsURI": "/trail/us/colorado/bear-peak-via-shanahan-ridge",
  "overview": "Bear Peak via Shanahan Ridge is a 5.8 mile heavily trafficked out and back trail located near Boulder, Colorado that features beautiful wild flowers and is rated as difficult. The trail is primarily used for hiking and running and is accessible year-round. Dogs are also able to use this trail.",
  "length": "5.8 mi",
  "elevationGain": "2,647 ft",
  "routeType": "Out & Back",
  "difficulty": "hard",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Bear Peak Canyon Loop Trail",
  "allTrailsURI": "/trail/us/colorado/bear-peak-canyon-loop-trail",
  "overview": "Bear Peak Canyon Loop Trail is a 7.6 mile heavily trafficked loop trail located near Boulder, Colorado that features a river and is rated as difficult. The trail offers a number of activity options and is best used from March until November. Dogs are also able to use this trail but must be kept on leash.",
  "length": "7.6 mi",
  "elevationGain": "2,811 ft",
  "routeType": "Loop",
  "difficulty": "hard",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "First and Second Flatiron",
  "allTrailsURI": "/trail/us/colorado/first-and-second-flatiron",
  "overview": "First and Second Flatiron is a 2.4 mile heavily trafficked out and back trail located near Boulder, Colorado that offers the chance to see wildlife and is rated as moderate. The trail is primarily used for hiking, running, rock climbing, and nature trips and is best used from May until October. Dogs are also able to use this trail.",
  "length": "2.4 mi",
  "elevationGain": "1,446 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Enchanted Mesa and McClintock Nature Trails",
  "allTrailsURI": "/trail/us/colorado/enchanted-mesa-and-mcclintock-nature-trails--2",
  "overview": "Enchanted Mesa and McClintock Nature Trails is a 1.9 mile heavily trafficked loop trail located near Boulder, Colorado that features a river and is good for all skill levels. The trail is primarily used for hiking, walking, running, and nature trips and is accessible year-round.",
  "length": "1.9 mi",
  "elevationGain": "419 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mount Sanitas Peak Trail",
  "allTrailsURI": "/trail/us/colorado/mount-sanitas-peak-trail",
  "overview": "Mount Sanitas Peak Trail is a 2.6 mile heavily trafficked out and back trail located near Boulder, Colorado that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is best used from April until September. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.6 mi",
  "elevationGain": "1,253 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Flatirons Vista Trail",
  "allTrailsURI": "/trail/us/colorado/flatirons-vista-trail",
  "overview": "Flatirons Vista Trail is a 3.5 mile heavily trafficked loop trail located near Boulder, Colorado that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is best used from March until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.5 mi",
  "elevationGain": "285 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Red Rocks Trail",
  "allTrailsURI": "/trail/us/colorado/red-rocks-trail",
  "overview": "Red Rocks Trail is a 1.1 mile heavily trafficked loop trail located near Boulder, Colorado that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking and is best used from May until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.1 mi",
  "elevationGain": "344 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mount Sanitas via Sanitas Valley and East Ridge Trail",
  "allTrailsURI": "/trail/us/colorado/mount-sanitas-via-sanitas-valley-and-east-ridge-trail",
  "overview": "Mount Sanitas via Sanitas Valley and East Ridge Trail is a 1.4 mile heavily trafficked out and back trail located near Boulder, Colorado that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, running, and nature trips.",
  "length": "1.4 mi",
  "elevationGain": "662 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Shanahan Ridge Trail",
  "allTrailsURI": "/trail/us/colorado/shanahan-ridge-trail",
  "overview": "Shanahan Ridge Trail is a 3.7 mile heavily trafficked loop trail located near Boulder, Colorado that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, walking, trail running, and nature trips and is best used from April until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.7 mi",
  "elevationGain": "790 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Gregory Canyon Ranger E M Greenman Saddle Rock Loop",
  "allTrailsURI": "/trail/us/colorado/gregory-canyon-ranger-em-greenman-saddle-rock-loop",
  "overview": "Gregory Canyon, Ranger, E.M. Greenman, Saddle Rock Loop is a 3.3 mile heavily trafficked loop trail located near Boulder, Colorado that features beautiful wild flowers and is rated as difficult. The trail is primarily used for hiking, running, nature trips, and bird watching and is best used from May until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.3 mi",
  "elevationGain": "1,476 ft",
  "routeType": "Loop",
  "difficulty": "hard",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "South Boulder Creek via Walker Ranch Trail",
  "allTrailsURI": "/trail/us/colorado/south-boulder-creek-via-walker-ranch-trail",
  "overview": "South Boulder Creek via Walker Ranch Trail is a 3.1 mile heavily trafficked out and back trail located near Boulder, Colorado that features a river and is rated as moderate. The trail is primarily used for hiking, running, and mountain biking and is best used from April until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.1 mi",
  "elevationGain": "610 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Kohler Mesa Trail",
  "allTrailsURI": "/trail/us/colorado/kohler-mesa-trail",
  "overview": "Kohler Mesa Trail is a 4 mile loop trail located near Boulder, Colorado that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking and trail running and is accessible year-round. Dogs are also able to use this trail.",
  "length": "4.0 mi",
  "elevationGain": "908 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Boulder Mesa Trail",
  "allTrailsURI": "/trail/us/colorado/boulder-mesa-trail",
  "overview": "Boulder Mesa Trail is a 13.2 mile heavily trafficked out and back trail located near Boulder, Colorado that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is best used from April until October. Dogs and horses are also able to use this trail.",
  "length": "13.2 mi",
  "elevationGain": "2,631 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Shanahan North Fork and Mesa Trail Loop",
  "allTrailsURI": "/trail/us/colorado/shanahan-north-fork-and-mesa-trail-loop",
  "overview": "Shanahan - North Fork and Mesa Trail Loop is a 3.6 mile moderately trafficked loop trail located near Boulder, Colorado that offers the chance to see wildlife and is rated as moderate. The trail is primarily used for hiking, running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.6 mi",
  "elevationGain": "830 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Dakota Ridge Trail",
  "allTrailsURI": "/trail/us/colorado/dakota-ridge-trail--3",
  "overview": "Dakota Ridge Trail is a 2.6 mile heavily trafficked loop trail located near Boulder, Colorado that offers scenic views. The trail is rated as moderate and is primarily used for hiking, walking, running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.6 mi",
  "elevationGain": "495 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Walden Ponds Wildlife Habitat Trail",
  "allTrailsURI": "/trail/us/colorado/walden-ponds-wildlife-habitat-trail",
  "overview": "Walden Ponds Wildlife Habitat Trail is a 1.4 mile lightly trafficked loop trail located near Boulder, Colorado that offers the chance to see wildlife and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.4 mi",
  "elevationGain": "9 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Amphitheater and Saddle Rock Loop",
  "allTrailsURI": "/trail/us/colorado/amphitheater-and-saddle-rock-loop",
  "overview": "Amphitheater and Saddle Rock Loop is a 0.9 mile heavily trafficked loop trail located near Boulder, Colorado that features a great forest setting. The trail is rated as moderate and is primarily used for hiking, walking, running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "0.9 mi",
  "elevationGain": "518 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Coal Seam Community Ditch Trail Marshall Mesa Mesa Valley Trail",
  "allTrailsURI": "/trail/us/colorado/coal-seam-community-ditch-trail-marshall-mesa-mesa-valley-trail",
  "overview": "Coal Seam, Community Ditch Trail, Marshall Mesa, Mesa Valley Trail is a 2.8 mile heavily trafficked loop trail located near Boulder, Colorado that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is best used from March until November. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.8 mi",
  "elevationGain": "200 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Greenbelt Plateau Trail",
  "allTrailsURI": "/trail/us/colorado/greenbelt-plateau-trail",
  "overview": "Greenbelt Plateau Trail is a 4.6 mile moderately trafficked out and back trail located near Boulder, Colorado that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is best used from March until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.6 mi",
  "elevationGain": "262 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Woods Quarry and Mesa Trail Loop via Four Pines",
  "allTrailsURI": "/trail/us/colorado/woods-quarry-and-mesa-trail-loop-via-four-pines",
  "overview": "Woods Quarry and Mesa Trail Loop via Four Pines is a 3.1 mile lightly trafficked loop trail located near Boulder, Colorado that offers the chance to see wildlife. The trail is good for all skill levels and primarily used for hiking and trail running. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.1 mi",
  "elevationGain": "872 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Red Rocks Spur Loop",
  "allTrailsURI": "/trail/us/colorado/red-rocks-spur-loop",
  "overview": "Red Rocks Spur Loop is a 0.6 mile moderately trafficked loop trail located near Boulder, Colorado that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for hiking, walking, nature trips, and bird watching and is best used from April until September.",
  "length": "0.6 mi",
  "elevationGain": "206 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Walter Orr Roberts Weather Trail",
  "allTrailsURI": "/trail/us/colorado/walter-orr-roberts-weather-trail",
  "overview": "Walter Orr Roberts Weather Trail is a 1 mile loop trail located near Boulder, Colorado that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for hiking and walking and is best used from April until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.0 mi",
  "elevationGain": "374 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mount Sanitas via Goat Trail",
  "allTrailsURI": "/trail/us/colorado/mount-sanitas-via-goat-trail",
  "overview": "Mount Sanitas via Goat Trail is a 2.1 mile out and back trail located near Boulder, Colorado that features a great forest setting and is rated as moderate. The trail is primarily used for hiking, walking, and nature trips. Dogs are also able to use this trail.",
  "length": "2.1 mi",
  "elevationGain": "1,059 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Road J",
  "allTrailsURI": "/trail/us/colorado/road-68j",
  "overview": "Road 68J is a 3 mile moderately trafficked point-to-point trail located near Boulder, Colorado that features beautiful wild flowers and is rated as moderate. The trail is primarily used for ohv/off road driving and is best used from April until October.",
  "length": "3.0 mi",
  "elevationGain": "380 ft",
  "routeType": "Point to Point",
  "difficulty": "moderate",
  "cityId": 6,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lakeshore Path North Ave Beach To Navy Pier",
  "allTrailsURI": "/trail/us/illinois/lakeshore-path-north-ave-beach-to-navy-pier",
  "overview": "Lakeshore Path: North Ave Beach To Navy Pier is a 1.8 mile moderately trafficked point-to-point trail located near Chicago, Illinois that offers scenic views and is rated as moderate. The trail is primarily used for walking and running.",
  "length": "1.8 mi",
  "elevationGain": "22 ft",
  "routeType": "Point to Point",
  "difficulty": "moderate",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Chicago Lakefront Trail",
  "allTrailsURI": "/trail/us/illinois/chicago-lakefront-trail",
  "overview": "Chicago Lakefront Trail is a 17.6 mile moderately trafficked point-to-point trail located near Chicago, Illinois that features a lake and is good for all skill levels. The trail offers a number of activity options and is best used from March until November. Dogs are also able to use this trail.",
  "length": "17.6 mi",
  "elevationGain": "282 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "South Shore Nature Sanctuary Loop",
  "allTrailsURI": "/trail/us/illinois/south-shore-nature-sanctuary-loop",
  "overview": "South Shore Nature Sanctuary Loop is a 0.5 mile loop trail located near Chicago, Illinois that offers scenic views and is good for all skill levels. The trail is primarily used for hiking, running, nature trips, and bird watching.",
  "length": "0.5 mi",
  "elevationGain": "6 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Rainbow Beach Dunes Trail",
  "allTrailsURI": "/trail/us/illinois/rainbow-beach-dunes-trail",
  "overview": "Rainbow Beach Dunes Trail is a 0.5 mile moderately trafficked loop trail located near Chicago, Illinois that features a lake and is good for all skill levels. The trail offers a number of activity options and is accessible year-round.",
  "length": "0.5 mi",
  "elevationGain": "16 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Chicago Riverwalk",
  "allTrailsURI": "/trail/us/illinois/chicago-riverwalk",
  "overview": "Chicago Riverwalk is a 2.7 mile heavily trafficked out and back trail located near Chicago, Illinois that features a river and is good for all skill levels. The trail is primarily used for walking and running and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.7 mi",
  "elevationGain": "13 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Rainbow Beach and Park Loop",
  "allTrailsURI": "/trail/us/illinois/rainbow-beach-and-park-loop",
  "overview": "Rainbow Beach and Park Loop is a 1.3 mile loop trail located near Chicago, Illinois that offers scenic views and is good for all skill levels. The trail is primarily used for hiking and nature trips.",
  "length": "1.3 mi",
  "elevationGain": "6 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lincoln Park Trail",
  "allTrailsURI": "/trail/us/illinois/lincoln-park-trail",
  "overview": "Lincoln Park Trail is a 5.5 mile moderately trafficked loop trail located near Chicago, Illinois that features a lake and is good for all skill levels. The trail offers a number of activity options and is best used from March until October. Dogs are also able to use this trail.",
  "length": "5.5 mi",
  "elevationGain": "78 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Bloomingdale Trail",
  "allTrailsURI": "/trail/us/illinois/bloomingdale-trail",
  "overview": "Bloomingdale Trail is a 5.5 mile lightly trafficked out and back trail located near Chicago, Illinois and is good for all skill levels. The trail is primarily used for hiking, walking, running, and road biking. Dogs are also able to use this trail but must be kept on leash.",
  "length": "5.5 mi",
  "elevationGain": "13 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "McCormick Place Bird Sanctuary",
  "allTrailsURI": "/trail/us/illinois/mccormick-place-bird-sanctuary",
  "overview": "McCormick Place Bird Sanctuary is a 0.3 mile moderately trafficked loop trail located near Chicago, Illinois that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for walking, nature trips, and bird watching and is best used from May until September. Dogs are also able to use this trail but must be kept on leash.",
  "length": "0.3 mi",
  "elevationGain": "0 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Montrose Harbor Trail",
  "allTrailsURI": "/trail/us/illinois/montrose-harbor-trail",
  "overview": "Montrose Harbor Trail is a 5.4 mile heavily trafficked out and back trail located near Chicago, Illinois that features a lake and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "5.4 mi",
  "elevationGain": "42 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Chicago Riverwalk to Grant Park",
  "allTrailsURI": "/trail/us/illinois/chicago-riverwalk-to-grant-park",
  "overview": "Chicago Riverwalk to Grant Park is a 4.8 mile heavily trafficked out and back trail located near Chicago, Illinois that features a lake and is good for all skill levels. The trail is primarily used for hiking, walking, nature trips, and birding and is accessible year-round. Dogs are also able to use this trail.",
  "length": "4.8 mi",
  "elevationGain": "49 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Magnificent Mile and Navy Pier Chicago",
  "allTrailsURI": "/trail/us/illinois/magnificent-mile-and-navy-pier-chicago",
  "overview": "Magnificent Mile and Navy Pier - Chicago is a 2.1 mile heavily trafficked point-to-point trail located near Chicago, Illinois that features a lake and is good for all skill levels. The trail is primarily used for hiking, walking, and nature trips and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.1 mi",
  "elevationGain": "6 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Columbia Basin Wooded Island Jackson Park Lagoon",
  "allTrailsURI": "/trail/us/illinois/columbia-basin-wooded-island-jackson-park-lagoon",
  "overview": "Columbia Basin, Wooded Island, Jackson Park Lagoon is a 1.7 mile loop trail located near Chicago, Illinois that features a lake and is good for all skill levels. The trail is primarily used for walking, nature trips, and bird watching. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.7 mi",
  "elevationGain": "32 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Museum and Lakefront Walking Tour",
  "allTrailsURI": "/trail/us/illinois/museum-and-lakefront-walking-tour",
  "overview": "Museum and Lakefront Walking Tour is a 2.2 mile out and back trail located near Chicago, Illinois that features a lake. The trail is good for all skill levels and primarily used for hiking and walking. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.2 mi",
  "elevationGain": "42 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Millennium Park Trail",
  "allTrailsURI": "/trail/us/illinois/millennium-park-trail",
  "overview": "Millennium Park Trail is a 0.7 mile moderately trafficked loop trail located near Chicago, Illinois that offers scenic views and is good for all skill levels. The trail is primarily used for hiking, walking, trail running, and nature trips and is best used from April until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "0.7 mi",
  "elevationGain": "16 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Chicago Outerbelt Route",
  "allTrailsURI": "/trail/us/illinois/chicago-outerbelt-route",
  "overview": "Chicago Outerbelt Route is a 220 mile loop trail located near Chicago, Illinois that offers scenic views and is good for all skill levels. The trail is primarily used for hiking, walking, running, and nature trips.",
  "length": "220.0 mi",
  "elevationGain": "3,874 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Navy Pier Walk",
  "allTrailsURI": "/trail/us/illinois/navy-pier-walk",
  "overview": "Navy Pier Walk is a 1.5 mile out and back trail located near Chicago, Illinois. The trail is good for all skill levels and primarily used for hiking and walking. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.5 mi",
  "elevationGain": "29 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Ping Tom Memorial Park Loop",
  "allTrailsURI": "/trail/us/illinois/ping-tom-memorial-park-loop",
  "overview": "Ping Tom Memorial Park Loop is a 1 mile moderately trafficked loop trail located near Chicago, Illinois that features a river and is good for all skill levels. The trail is primarily used for walking, trail running, and road biking and is best used from April until October.",
  "length": "1.0 mi",
  "elevationGain": "19 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Humboldt Park Lagoon and Beach Loop",
  "allTrailsURI": "/trail/us/illinois/humboldt-park-lagoon-loop",
  "overview": "Humboldt Park Lagoon and Beach Loop is a 2.1 mile moderately trafficked loop trail located near Chicago, Illinois that features a waterfall and is good for all skill levels. The trail is primarily used for hiking, walking, bird watching, and fishing. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.1 mi",
  "elevationGain": "29 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Washington Lagoon Loop",
  "allTrailsURI": "/trail/us/illinois/washington-lagoon-loop",
  "overview": "Washington Lagoon Loop is a 1.2 mile loop trail located near Chicago, Illinois that features a lake. The trail is rated as moderate and primarily used for hiking, walking, trail running, and nature trips.",
  "length": "1.2 mi",
  "elevationGain": "6 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Steelworkers Park Trail",
  "allTrailsURI": "/trail/us/illinois/steelworkers-park-trail",
  "overview": "Steelworkers Park Trail is a 0.8 mile lightly trafficked loop trail located near Chicago, Illinois that features a lake and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "0.8 mi",
  "elevationGain": "9 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Bobolink Meadow Trail",
  "allTrailsURI": "/trail/us/illinois/bobolink-meadow-trail",
  "overview": "Bobolink Meadow Trail is a 0.8 mile moderately trafficked loop trail located near Chicago, Illinois that features a lake and is good for all skill levels. The trail is primarily used for walking, running, and bird watching and is best used from February until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "0.8 mi",
  "elevationGain": "6 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Hyde Park Kenwood and South Shore Neighborhoods Walking Tour",
  "allTrailsURI": "/trail/us/illinois/hyde-park-kenwood-and-south-shore-neighborhoods-walking-tour",
  "overview": "Hyde Park, Kenwood, and South Shore Neighborhoods Walking Tour is a 10.6 mile out and back trail located near Chicago, Illinois and is good for all skill levels. The trail is primarily used for walking. Dogs are also able to use this trail but must be kept on leash.",
  "length": "10.6 mi",
  "elevationGain": "65 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lakefront Trail Jackson Park to Grant Park",
  "allTrailsURI": "/trail/us/illinois/lakefront-trail-jackson-park-to-grant-park",
  "overview": "Lakefront Trail: Jackson Park to Grant Park is a 8.6 mile point-to-point trail located near Chicago, Illinois that features a lake and is good for all skill levels. The trail is primarily used for hiking, walking, running, and mountain biking.",
  "length": "8.6 mi",
  "elevationGain": "141 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 7,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Green Mountain via Green Mountain and Hayden Trail Loop",
  "allTrailsURI": "/trail/us/colorado/green-mountain-via-green-mountain-and-hayden-trail-loop",
  "overview": "Green Mountain via Green Mountain and Hayden Trail Loop is a 4.6 mile heavily trafficked loop trail located near Denver, Colorado that offers the chance to see wildlife and is rated as moderate. The trail is primarily used for hiking, running, and mountain biking and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.6 mi",
  "elevationGain": "898 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Washington Park Loop",
  "allTrailsURI": "/trail/us/colorado/washington-park-loop",
  "overview": "Washington Park Loop is a 2.3 mile heavily trafficked loop trail located near Denver, Colorado that features a lake and is good for all skill levels. The trail offers a number of activity options and is best used from April until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.3 mi",
  "elevationGain": "42 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Green Mountain and Hayden Trail Loop",
  "allTrailsURI": "/trail/us/colorado/green-mountain-and-hayden-trail-loop",
  "overview": "Green Mountain and Hayden Trail Loop is a 3.2 mile heavily trafficked loop trail located near Denver, Colorado that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.2 mi",
  "elevationGain": "633 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Green Mountain Trail",
  "allTrailsURI": "/trail/us/colorado/green-mountain-trail--4",
  "overview": "Green Mountain Trail is a 6.4 mile heavily trafficked loop trail located near Denver, Colorado that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, walking, nature trips, and bird watching and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "6.4 mi",
  "elevationGain": "1,010 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Cherry Creek Trail",
  "allTrailsURI": "/trail/us/colorado/cherry-creek-trail",
  "overview": "Cherry Creek Trail is a 12.7 mile heavily trafficked point-to-point trail located near Denver, Colorado that features a river and is good for all skill levels. The trail offers a number of activity options and is best used from March until October. Dogs are also able to use this trail.",
  "length": "12.7 mi",
  "elevationGain": "479 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Green Mountain Rooney Valley and Rooney Trail Loop",
  "allTrailsURI": "/trail/us/colorado/green-mountain-rooney-valley-and-rooney-trail-loop",
  "overview": "Green Mountain, Rooney Valley and Rooney Trail Loop is a 5.8 mile moderately trafficked loop trail located near Denver, Colorado that offers the chance to see wildlife and is rated as moderate. The trail is primarily used for hiking, running, and bird watching and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "5.8 mi",
  "elevationGain": "944 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Green Mountain and Hayden Trail Loop",
  "allTrailsURI": "/trail/us/colorado/green-mountain-and-hayden-trail",
  "overview": "Green Mountain and Hayden Trail Loop is a 1.8 mile heavily trafficked loop trail located near Denver, Colorado that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for hiking, walking, running, and mountain biking and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.8 mi",
  "elevationGain": "396 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Cherry Creek Trail Hungarian Freedom Park to Commons Park",
  "allTrailsURI": "/trail/us/colorado/cherry-creek-trail-hungarian-freedom-park-to-commons-park",
  "overview": "Cherry Creek Trail: Hungarian Freedom Park to Commons Park is a 6.2 mile heavily trafficked out and back trail located near Denver, Colorado that features a river and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "6.2 mi",
  "elevationGain": "98 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Crown Hill Lake Loop and Nature Trail",
  "allTrailsURI": "/trail/us/colorado/crown-hill-lake-loop-and-nature-trail",
  "overview": "Crown Hill Lake Loop and Nature Trail is a 1.6 mile heavily trafficked loop trail located near Denver, Colorado that features a lake and is good for all skill levels. The trail offers a number of activity options and is best used from April until December. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.6 mi",
  "elevationGain": "42 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Green Mountain Trail",
  "allTrailsURI": "/trail/us/colorado/green-mountain-trail--5",
  "overview": "Green Mountain Trail  is a 3.2 mile heavily trafficked out and back trail located near Denver, Colorado that features beautiful wild flowers. The trail is rated as moderate and offers a number of activity options. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.2 mi",
  "elevationGain": "790 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Green Mountain Novice Loop",
  "allTrailsURI": "/trail/us/colorado/green-mountain-novice-loop",
  "overview": "Green Mountain Novice Loop is a 6.3 mile moderately trafficked loop trail located near Denver, Colorado that offers scenic views and is rated as moderate. The trail offers a number of activity options and is best used from April until September. Dogs are also able to use this trail but must be kept on leash.",
  "length": "6.3 mi",
  "elevationGain": "1,072 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Rooney Trail Loop",
  "allTrailsURI": "/trail/us/colorado/rooney-trail-loop",
  "overview": "Rooney Trail Loop is a 3.4 mile heavily trafficked loop trail located near Denver, Colorado that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for hiking, walking, nature trips, and mountain biking and is best used from April until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.4 mi",
  "elevationGain": "410 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Belmar Park",
  "allTrailsURI": "/trail/us/colorado/belmar-park",
  "overview": "Belmar Park is a 2.9 mile moderately trafficked loop trail located near Denver, Colorado that offers scenic views and is good for all skill levels. The trail offers a number of activity options and is best used from April until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.9 mi",
  "elevationGain": "121 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Bear Creek Greenbelt Lakewood Trail",
  "allTrailsURI": "/trail/us/colorado/bear-creek-greenbelt-lakewood-trail",
  "overview": "Bear Creek Greenbelt Lakewood Trail is a 3.3 mile heavily trafficked out and back trail located near Denver, Colorado and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.3 mi",
  "elevationGain": "49 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "South Platte River Greenway Trail East",
  "allTrailsURI": "/trail/us/colorado/south-platte-river-greenway-trail-east",
  "overview": "South Platte River Greenway Trail East is a 13.9 mile heavily trafficked out and back trail located near Denver, Colorado that features a river and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "13.9 mi",
  "elevationGain": "229 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Cherry Creek Pipeline Trail",
  "allTrailsURI": "/trail/us/colorado/cherry-creek-pipeline-trail--2",
  "overview": "Cherry Creek Pipeline Trail is a 1.4 mile moderately trafficked out and back trail located near Denver, Colorado that features a river and is good for all skill levels. The trail is primarily used for hiking, walking, nature trips, and bird watching and is best used from February until November.",
  "length": "1.4 mi",
  "elevationGain": "13 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Bear Creek Trail to Stone House Trail Loop",
  "allTrailsURI": "/trail/us/colorado/bear-creek-trail-to-stone-house-trail-loop",
  "overview": "Bear Creek Trail to Stone House Trail Loop is a 3.2 mile moderately trafficked loop trail located near Denver, Colorado that features a lake. The trail is good for all skill levels and primarily used for hiking, walking, trail running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.2 mi",
  "elevationGain": "45 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Cheesman Park Outer Loop",
  "allTrailsURI": "/trail/us/colorado/cheesman-park-outer-loop",
  "overview": "Cheesman Park Outer Loop is a 1.8 mile loop trail located near Denver, Colorado and is good for all skill levels. The trail is primarily used for hiking, walking, trail running, and nature trips and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.8 mi",
  "elevationGain": "85 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Bible Park Trail Loop",
  "allTrailsURI": "/trail/us/colorado/bible-park-trails",
  "overview": "Bible Park Trail Loop is a 1.7 mile moderately trafficked loop trail located near Denver, Colorado and is good for all skill levels. The trail is primarily used for walking, running, and nature trips and is accessible year-round. Dogs are also able to use this trail.",
  "length": "1.7 mi",
  "elevationGain": "26 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Highline Canal Trail",
  "allTrailsURI": "/trail/us/colorado/highline-canal-trail",
  "overview": "Highline Canal Trail is a 7.2 mile moderately trafficked point-to-point trail located near Denver, Colorado and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "7.2 mi",
  "elevationGain": "82 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "City Park Perimeter Loop",
  "allTrailsURI": "/trail/us/colorado/city-park-perimeter-loop",
  "overview": "City Park Perimeter Loop is a 3.8 mile lightly trafficked loop trail located near Denver, Colorado that features a lake and is good for all skill levels. The trail is primarily used for hiking, walking, trail running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.8 mi",
  "elevationGain": "68 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Green Mountain MTB Loop",
  "allTrailsURI": "/trail/us/colorado/green-mountain-mtb-loop",
  "overview": "Green Mountain MTB Loop is a 6.2 mile moderately trafficked loop trail located near Denver, Colorado that features a great forest setting and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "6.2 mi",
  "elevationGain": "1,007 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Coalton Road to the High Plains Trail",
  "allTrailsURI": "/trail/us/colorado/coalton-road-to-the-high-plains-trail",
  "overview": "Coalton Road to the High Plains Trail is a 10.4 mile moderately trafficked out and back trail located near Denver, Colorado that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "10.4 mi",
  "elevationGain": "705 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Green Mountain Trail Loop",
  "allTrailsURI": "/trail/us/colorado/green-mountain-trail-loop",
  "overview": "Green Mountain Trail Loop is a 1.8 mile lightly trafficked loop trail located near Denver, Colorado that offers the chance to see wildlife. The trail is good for all skill levels and is primarily used for hiking, walking, and trail running. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.8 mi",
  "elevationGain": "206 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Platte River Trail Loop",
  "allTrailsURI": "/trail/us/colorado/platte-river-trail-loop",
  "overview": "Platte River Trail Loop is a 4.2 mile lightly trafficked loop trail located near Denver, Colorado that features a river and is good for all skill levels. The trail is primarily used for hiking, walking, trail running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.2 mi",
  "elevationGain": "75 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Little Dry Creek Trail",
  "allTrailsURI": "/trail/us/colorado/little-dry-creek-trail",
  "overview": "Little Dry Creek Trail is a 9.2 mile moderately trafficked point-to-point trail located near Denver, Colorado and is rated as moderate. The trail is primarily used for walking, trail running, and road biking and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "9.2 mi",
  "elevationGain": "446 ft",
  "routeType": "Point to Point",
  "difficulty": "moderate",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lakewood Gulch Trail",
  "allTrailsURI": "/trail/us/colorado/lakewood-gulch-trail",
  "overview": "Lakewood Gulch Trail is a 4.1 mile lightly trafficked out and back trail located near Denver, Colorado that features a river and is good for all skill levels. The trail is primarily used for walking and trail running. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.1 mi",
  "elevationGain": "118 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Inspiration Point Park",
  "allTrailsURI": "/trail/us/colorado/inspiration-point-park",
  "overview": "Inspiration Point Park is a 0.8 mile moderately trafficked loop trail located near Denver, Colorado that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options.",
  "length": "0.8 mi",
  "elevationGain": "16 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Denver Highlands to Golden Bike Ride",
  "allTrailsURI": "/trail/us/colorado/denver-highlands-to-golden-bike-ride",
  "overview": "Denver Highlands to Golden Bike Ride is a 20.9 mile out and back trail located near Denver, Colorado and is rated as moderate. The trail is primarily used for road biking.",
  "length": "20.9 mi",
  "elevationGain": "895 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "City of Cuernavaca Park Loop",
  "allTrailsURI": "/trail/us/colorado/city-of-cuernavaca-park-loop",
  "overview": "City of Cuernavaca Park Loop is a 0.5 mile lightly trafficked loop trail located near Denver, Colorado and is good for all skill levels. The trail is primarily used for walking, trail running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "0.5 mi",
  "elevationGain": "9 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Sand Creek Trail",
  "allTrailsURI": "/trail/us/colorado/sand-creek-trail--4",
  "overview": "Sand Creek Trail is a 11.7 mile moderately trafficked out and back trail located near Denver, Colorado that features a river and is rated as moderate. The trail offers a number of activity options.",
  "length": "11.7 mi",
  "elevationGain": "278 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Kendrick Main Reservoir",
  "allTrailsURI": "/trail/us/colorado/kendrick-main-reservoir",
  "overview": "Kendrick Main Reservoir is a 1.2 mile moderately trafficked loop trail located near Denver, Colorado that features a lake and is good for all skill levels. The trail is primarily used for walking and nature trips. Dogs are also able to use this trail.",
  "length": "1.2 mi",
  "elevationGain": "22 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Huston Lake Trail",
  "allTrailsURI": "/trail/us/colorado/huston-lake-trail",
  "overview": "Huston Lake Trail is a 1 mile moderately trafficked loop trail located near Denver, Colorado that features a lake and is good for all skill levels. The trail offers a number of activity options and is best used from April until September. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.0 mi",
  "elevationGain": "9 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Platte River Trail to Sand Creek Trail",
  "allTrailsURI": "/trail/us/colorado/platte-river-trail-to-sand-creek-trail",
  "overview": "Platte River Trail to Sand Creek Trail is a 16 mile lightly trafficked out and back trail located near Denver, Colorado that features a river and is good for all skill levels. The trail offers a number of activity options. Dogs are also able to use this trail but must be kept on leash.",
  "length": "16.0 mi",
  "elevationGain": "321 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Dry Gulch Trail Loop",
  "allTrailsURI": "/trail/us/colorado/dry-gulch-trail-loop",
  "overview": "Dry Gulch Trail Loop is a 2.6 mile loop trail located near Denver, Colorado. The trail is good for all skill levels and is primarily used for hiking, walking, and trail running. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.6 mi",
  "elevationGain": "141 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Weir Gulch Trail",
  "allTrailsURI": "/trail/us/colorado/weir-gulch-trail",
  "overview": "Weir Gulch Trail is a 7.8 mile lightly trafficked out and back trail located near Denver, Colorado that offers scenic views and is good for all skill levels. The trail offers a number of activity options. Dogs are also able to use this trail but must be kept on leash.",
  "length": "7.8 mi",
  "elevationGain": "232 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Garfield Lake Loop",
  "allTrailsURI": "/trail/us/colorado/garfield-lake-loop",
  "overview": "Garfield Lake Loop is a 0.9 mile lightly trafficked loop trail located near Denver, Colorado that features a lake and is good for all skill levels. The trail is primarily used for walking, nature trips, and bird watching. Dogs are also able to use this trail but must be kept on leash.",
  "length": "0.9 mi",
  "elevationGain": "6 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "North Green Mountain Trail",
  "allTrailsURI": "/trail/us/colorado/north-green-mountain-trail",
  "overview": "North Green Mountain Trail is a 0.9 mile moderately trafficked loop trail located near Denver, Colorado that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for walking, nature trips, and bird watching and is best used from April until September. Dogs are also able to use this trail but must be kept on leash.",
  "length": "0.9 mi",
  "elevationGain": "52 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Northwest Open Space Southern Loop",
  "allTrailsURI": "/trail/us/colorado/northwest-open-space-southern-loop",
  "overview": "Northwest Open Space Southern Loop is a 0.8 mile moderately trafficked loop trail located near Denver, Colorado and is good for all skill levels. The trail is primarily used for walking, running, and road biking and is best used from March until November.",
  "length": "0.8 mi",
  "elevationGain": "19 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Union Square Park Loop",
  "allTrailsURI": "/trail/us/colorado/union-square-park",
  "overview": "Union Square Park Loop is a 1.1 mile moderately trafficked loop trail located near Denver, Colorado that features a lake. The trail is good for all skill levels and is primarily used for hiking and walking. Dogs are also able to use this trail.",
  "length": "1.1 mi",
  "elevationGain": "95 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Webster Lake Loop",
  "allTrailsURI": "/trail/us/colorado/webster-lake-loop",
  "overview": "Webster Lake Loop is a 0.6 mile moderately trafficked loop trail located near Denver, Colorado that features a lake and is good for all skill levels. The trail is primarily used for hiking, walking, running, and bird watching.",
  "length": "0.6 mi",
  "elevationGain": "3 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Crestmoor Park Loop",
  "allTrailsURI": "/trail/us/colorado/crestmoor-park-loop",
  "overview": "Crestmoor Park Loop is a 1 mile lightly trafficked loop trail located near Denver, Colorado and is good for all skill levels. The trail is primarily used for walking, trail running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.0 mi",
  "elevationGain": "16 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Westerly Creek Trail",
  "allTrailsURI": "/trail/us/colorado/westerly-creek-trail--2",
  "overview": "Westerly Creek Trail is a 2.4 mile moderately trafficked out and back trail located near Denver, Colorado and is good for all skill levels. The trail offers a number of activity options.",
  "length": "2.4 mi",
  "elevationGain": "62 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Rosamond Park",
  "allTrailsURI": "/trail/us/colorado/rosamond-park",
  "overview": "Rosamond Park is a 0.8 mile moderately trafficked loop trail located near Denver, Colorado and is good for all skill levels. The trail is primarily used for walking and nature trips.",
  "length": "0.8 mi",
  "elevationGain": "22 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Wright Park",
  "allTrailsURI": "/trail/us/colorado/wright-park",
  "overview": "Wright Park is a 0.5 mile lightly trafficked loop trail located near Denver, Colorado and is good for all skill levels. The trail offers a number of activity options and is best used from April until October. Dogs are also able to use this trail.",
  "length": "0.5 mi",
  "elevationGain": "26 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Sunken Gardens Park Loop",
  "allTrailsURI": "/trail/us/colorado/sunken-gardens-park-loop",
  "overview": "Sunken Gardens Park Loop is a 0.8 mile lightly trafficked loop trail located near Denver, Colorado and is good for all skill levels. The trail is primarily used for walking, trail running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "0.8 mi",
  "elevationGain": "13 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Four Mile House Park Trail",
  "allTrailsURI": "/trail/us/colorado/four-mile-house-park-trail",
  "overview": "Four Mile House Park Trail is a 0.4 mile moderately trafficked loop trail located near Denver, Colorado that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round.",
  "length": "0.4 mi",
  "elevationGain": "3 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Alamo Placita Park Trail",
  "allTrailsURI": "/trail/us/colorado/alamo-placita-park-trail",
  "overview": "Alamo Placita Park Trail is a 0.4 mile lightly trafficked loop trail located near Denver, Colorado and is good for all skill levels. The trail is primarily used for walking and bird watching and is accessible year-round. Dogs are also able to use this trail.",
  "length": "0.4 mi",
  "elevationGain": "3 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Heron Pond Loop",
  "allTrailsURI": "/trail/us/colorado/huron-pond-loop",
  "overview": "Heron Pond Loop is a 1.3 mile lightly trafficked loop trail located near Denver, Colorado that features a lake and is good for all skill levels. The trail offers a number of activity options. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.3 mi",
  "elevationGain": "16 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 8,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Hollyridge Trail to Hollywood Sign Viewpoint",
  "allTrailsURI": "/trail/us/california/hollyridge-trail",
  "overview": "Hollyridge Trail to Hollywood Sign Viewpoint is a 5.1 mile heavily trafficked out and back trail located near Los Angeles, California that offers scenic views and is rated as moderate. The trail is primarily used for hiking, walking, running, nature trips, and horses and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "5.1 mi",
  "elevationGain": "849 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Ferndell to the West Observatory Loop Trail to Griffith Observatory",
  "allTrailsURI": "/trail/us/california/ferndell-to-the-west-observatory-loop-trail-to-griffith-observatory",
  "overview": "Ferndell to the West Observatory Loop Trail to Griffith Observatory is a 2.5 mile heavily trafficked loop trail located near Los Angeles, California that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.5 mi",
  "elevationGain": "613 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Glendale Peak Trail",
  "allTrailsURI": "/trail/us/california/glendale-peak-trail",
  "overview": "Glendale Peak Trail is a 3.6 mile heavily trafficked loop trail located near Los Angeles, California that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.6 mi",
  "elevationGain": "833 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mount Hollywood Trail",
  "allTrailsURI": "/trail/us/california/mt-hollywood-trail",
  "overview": "Mount Hollywood Trail is a 5.3 mile heavily trafficked loop trail located near Los Angeles, California that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "5.3 mi",
  "elevationGain": "1,250 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mandeville Canyon Trail",
  "allTrailsURI": "/trail/us/california/mandeville-canyon-trail",
  "overview": "Mandeville Canyon Trail is a 7.1 mile heavily trafficked out and back trail located near Los Angeles, California that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail.",
  "length": "7.1 mi",
  "elevationGain": "1,102 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Riverside Trail to Vista Viewpoint",
  "allTrailsURI": "/trail/us/california/riverside-trail-to-vista-viewpoint",
  "overview": "Riverside Trail to Vista Viewpoint is a 2.5 mile heavily trafficked out and back trail located near Los Angeles, California that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is accessible year-round.",
  "length": "2.5 mi",
  "elevationGain": "429 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Bronson Caves",
  "allTrailsURI": "/trail/us/california/bronson-caves",
  "overview": "Bronson Caves is a 0.6 mile heavily trafficked out and back trail located near Los Angeles, California that features a cave and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail.",
  "length": "0.6 mi",
  "elevationGain": "75 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Griffith Park Hollywood Sign Trail",
  "allTrailsURI": "/trail/us/california/griffith-park-hollywood-sign-trail",
  "overview": "Griffith Park Hollywood Sign Trail is a 8.7 mile heavily trafficked loop trail located near Los Angeles, California that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "8.7 mi",
  "elevationGain": "1,906 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Veteran s Park Trail",
  "allTrailsURI": "/trail/us/california/veterans-park-trail",
  "overview": "Veteran's Park Trail is a 2.2 mile heavily trafficked loop trail located near Los Angeles, California that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.2 mi",
  "elevationGain": "702 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Elysian Park West Loop Trail",
  "allTrailsURI": "/trail/us/california/elysian-park-west-loop-trail",
  "overview": "Elysian Park West Loop Trail is a 2.3 mile heavily trafficked loop trail located near Los Angeles, California that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.3 mi",
  "elevationGain": "236 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Kenneth Hahn Recreation Area",
  "allTrailsURI": "/trail/us/california/kenneth-hahn-recreation-area",
  "overview": "Kenneth Hahn Recreation Area is a 2.6 mile heavily trafficked loop trail located near Los Angeles, California that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.6 mi",
  "elevationGain": "377 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mount Hollywood Trail",
  "allTrailsURI": "/trail/us/california/mount-hollywood-trail",
  "overview": "Mount Hollywood Trail is a 2.4 mile heavily trafficked loop trail located near Los Angeles, California that offers scenic views and is rated as moderate. The trail is primarily used for hiking, walking, running, and horses and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.4 mi",
  "elevationGain": "492 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Betty B Dearing Mountain Trail",
  "allTrailsURI": "/trail/us/california/betty-b-dearing-mountain-trail",
  "overview": "Betty B Dearing Mountain Trail is a 5 mile heavily trafficked out and back trail located near Los Angeles, California that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, walking, and running and is accessible year-round. Dogs are also able to use this trail.",
  "length": "5.0 mi",
  "elevationGain": "971 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Fern Canyon Trail",
  "allTrailsURI": "/trail/us/california/fern-canyon-trail--5",
  "overview": "Fern Canyon Trail is a 3.3 mile heavily trafficked out and back trail located near Los Angeles, California that offers scenic views and is rated as moderate. The trail is primarily used for hiking, walking, running, and nature trips and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.3 mi",
  "elevationGain": "620 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Old Zoo Trail",
  "allTrailsURI": "/trail/us/california/old-zoo-trail",
  "overview": "Old Zoo Trail is a 7 mile heavily trafficked loop trail located near Los Angeles, California that offers the chance to see wildlife and is rated as moderate. The trail is primarily used for hiking, walking, running, and horses and is best used from August until October. Dogs and horses are also able to use this trail.",
  "length": "7.0 mi",
  "elevationGain": "561 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Griffith Park Old Zoo Loop",
  "allTrailsURI": "/trail/us/california/griffith-park-old-zoo-loop",
  "overview": "Griffith Park Old Zoo Loop is a 2.7 mile heavily trafficked loop trail located near Los Angeles, California that offers scenic views and is good for all skill levels. The trail offers a number of activity options and is accessible year-round.",
  "length": "2.7 mi",
  "elevationGain": "419 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mission Point via De Campos Trail",
  "allTrailsURI": "/trail/us/california/mission-point-via-de-campos-trail",
  "overview": "Mission Point via De Campos Trail is a 4.4 mile heavily trafficked out and back trail located near Los Angeles, California that offers the chance to see wildlife and is rated as moderate. The trail is primarily used for hiking, walking, running, and mountain biking and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.4 mi",
  "elevationGain": "1,171 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Aliso Canyon",
  "allTrailsURI": "/trail/us/california/aliso-canyon",
  "overview": "Aliso Canyon is a 3.4 mile heavily trafficked out and back trail located near Los Angeles, California that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.4 mi",
  "elevationGain": "370 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Temescal Canyon Viewpoint Trail",
  "allTrailsURI": "/trail/us/california/temescal-canyon-viewpoint-trail",
  "overview": "Temescal Canyon Viewpoint Trail is a 1.3 mile lightly trafficked out and back trail located near Los Angeles, California that offers the chance to see wildlife and is rated as moderate. The trail is primarily used for hiking, walking, running, and nature trips.",
  "length": "1.3 mi",
  "elevationGain": "482 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Ascot Hills Trail",
  "allTrailsURI": "/trail/us/california/ascot-hills-trail",
  "overview": "Ascot Hills Trail is a 2.1 mile heavily trafficked loop trail located near Los Angeles, California that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, walking, running, and nature trips and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.1 mi",
  "elevationGain": "567 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Caballero Canyon to Mulholland Drive",
  "allTrailsURI": "/trail/us/california/caballero-canyon-to-mulholland-drive",
  "overview": "Caballero Canyon to Mulholland Drive is a 3.2 mile heavily trafficked out and back trail located near Los Angeles, California that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is accessible year-round.",
  "length": "3.2 mi",
  "elevationGain": "567 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Amir s Garden Trail",
  "allTrailsURI": "/trail/us/california/amirs-garden-trail",
  "overview": "Amir's Garden Trail is a 1.1 mile heavily trafficked loop trail located near Los Angeles, California that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.1 mi",
  "elevationGain": "275 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Captain s Roost via East Observatory Trail to Charlie Turner Trail",
  "allTrailsURI": "/trail/us/california/captain-s-roost-via-east-observatory-trail-to-charlie-turner-trail",
  "overview": "Captain's Roost via East Observatory Trail to Charlie Turner Trail is a 4 mile heavily trafficked out and back trail located near Los Angeles, California that offers scenic views and is rated as moderate. The trail is primarily used for hiking, running, and nature trips.",
  "length": "4.0 mi",
  "elevationGain": "793 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Brush Canyon Brush Canyon Trail",
  "allTrailsURI": "/trail/us/california/brush-canyon-brush-canyon-trail",
  "overview": "Brush Canyon: Brush Canyon Trail is a 2.8 mile out and back trail located near Los Angeles, California that offers scenic views. The trail is rated as moderate and primarily used for hiking, walking, and trail running. Dogs are also able to use this trail.",
  "length": "2.8 mi",
  "elevationGain": "725 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mount Washington Neighborhood Trails",
  "allTrailsURI": "/trail/us/california/mount-washington-neighborhood-trails",
  "overview": "Mount Washington Neighborhood Trails is a 2.7 mile moderately trafficked out and back trail located near Los Angeles, California that offers scenic views and is rated as moderate. The trail is primarily used for walking and running and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.7 mi",
  "elevationGain": "616 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Sullivan Fire Road to Backbone Trail Loop",
  "allTrailsURI": "/trail/us/california/sullivan-fire-road-to-backbone-trail-loop",
  "overview": "Sullivan Fire Road to Backbone Trail Loop is a 16 mile moderately trafficked loop trail located near Los Angeles, California that features a great forest setting. The trail is rated as difficult and is primarily used for hiking and mountain biking.",
  "length": "16.0 mi",
  "elevationGain": "3,139 ft",
  "routeType": "Loop",
  "difficulty": "hard",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Sullivan Canyon Loop",
  "allTrailsURI": "/trail/us/california/sullivan-canyon-loop--3",
  "overview": "Sullivan Canyon Loop is a 5.7 mile moderately trafficked loop trail located near Los Angeles, California that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, running, and mountain biking and is accessible year-round. Dogs are also able to use this trail.",
  "length": "5.7 mi",
  "elevationGain": "1,630 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Santa Susana Pass",
  "allTrailsURI": "/trail/us/california/santa-susana-pass",
  "overview": "Santa Susana Pass is a 1.9 mile moderately trafficked loop trail located near Los Angeles, California that offers scenic views and is rated as moderate. The trail offers a number of activity options and is accessible year-round.",
  "length": "1.9 mi",
  "elevationGain": "410 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Peaks Challenge Griffith Park",
  "allTrailsURI": "/trail/us/california/10-peaks-challenge-griffith-park",
  "overview": "10 Peaks Challenge Griffith Park is a 10.3 mile heavily trafficked loop trail located near Los Angeles, California that offers scenic views and is rated as moderate. The trail is primarily used for hiking, running, and nature trips.",
  "length": "10.3 mi",
  "elevationGain": "2,519 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Caballero Canyon and Reseda Loop",
  "allTrailsURI": "/trail/us/california/caballero-canyon-and-reseda-loop",
  "overview": "Caballero Canyon and Reseda Loop is a 3.7 mile moderately trafficked loop trail located near Los Angeles, California that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, walking, nature trips, and bird watching and is accessible year-round.",
  "length": "3.7 mi",
  "elevationGain": "803 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Harbor Park Area Trails",
  "allTrailsURI": "/trail/us/california/harbor-park-area-trails",
  "overview": "Harbor Park Area Trails is a 3.4 mile lightly trafficked out and back trail located near Los Angeles, California that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.4 mi",
  "elevationGain": "104 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Peanut Lake",
  "allTrailsURI": "/trail/us/california/peanut-lake",
  "overview": "Peanut Lake is a 2.3 mile lightly trafficked out and back trail located near Los Angeles, California that offers scenic views and is good for all skill levels. The trail is primarily used for hiking and running.",
  "length": "2.3 mi",
  "elevationGain": "485 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Tiger Tail Trail",
  "allTrailsURI": "/trail/us/california/tiger-tail-trail",
  "overview": "Tiger Tail Trail is a 2.9 mile lightly trafficked out and back trail located near Los Angeles, California that features beautiful wild flowers and is rated as difficult. The trail is primarily used for hiking and is accessible year-round.",
  "length": "2.9 mi",
  "elevationGain": "862 ft",
  "routeType": "Out & Back",
  "difficulty": "hard",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mount Baby Bell and Mount Chapel via Bronson Canyon Trail",
  "allTrailsURI": "/trail/us/california/mount-baby-bell-and-mount-chapel-via-bronson-canyon-trail",
  "overview": "Mount Baby Bell and Mount Chapel via Bronson Canyon Trail is a 4.1 mile out and back trail located near Los Angeles, California that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, walking, running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.1 mi",
  "elevationGain": "1,013 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "O Melveny Nature Trail Loop",
  "allTrailsURI": "/trail/us/california/omelveny-nature-trail-loop",
  "overview": "O'Melveny Nature Trail Loop is a 1.6 mile moderately trafficked loop trail located near Los Angeles, California that features a great forest setting. The trail is rated as moderate and is primarily used for hiking, walking, running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.6 mi",
  "elevationGain": "252 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Bee Rock Loop",
  "allTrailsURI": "/trail/us/california/bee-rock-loop",
  "overview": "Bee Rock Loop is a 2.6 mile moderately trafficked loop trail located near Los Angeles, California that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.6 mi",
  "elevationGain": "715 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Griffith Observatory Peak Trail",
  "allTrailsURI": "/trail/us/california/griffith-observatory-peak-trail",
  "overview": "Griffith Observatory Peak Trail is a 4 mile heavily trafficked out and back trail located near Los Angeles, California that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, walking, nature trips, and birding and is accessible year-round. Dogs are also able to use this trail.",
  "length": "4.0 mi",
  "elevationGain": "725 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mount Hollywood and Mount Bell Trail",
  "allTrailsURI": "/trail/us/california/mount-hollywood-and-mount-bell-trail",
  "overview": "Mount Hollywood and Mount Bell Trail is a 6.4 mile heavily trafficked loop trail located near Los Angeles, California that offers scenic views and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "6.4 mi",
  "elevationGain": "1,509 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Los Angeles River West Bank Trail",
  "allTrailsURI": "/trail/us/california/los-angeles-river-west-bank-trail",
  "overview": "Los Angeles River: West Bank Trail is a 14.3 mile lightly trafficked out and back trail located near Los Angeles, California that features a river and is good for all skill levels. The trail is primarily used for hiking, walking, running, and road biking and is accessible year-round. Dogs are also able to use this trail.",
  "length": "14.3 mi",
  "elevationGain": "236 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Vista Hermosa Nature Park",
  "allTrailsURI": "/trail/us/california/vista-hermosa-nature-park",
  "overview": "Vista Hermosa Nature Park is a 0.4 mile heavily trafficked loop trail located near Los Angeles, California that features a waterfall and is good for all skill levels. The trail is primarily used for hiking, walking, and nature trips and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "0.4 mi",
  "elevationGain": "52 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "San Gabriel River Bike Path",
  "allTrailsURI": "/trail/us/california/san-gabriel-river-bike-path",
  "overview": "San Gabriel River Bike Path is a 32.6 mile heavily trafficked point-to-point trail located near Los Angeles, California that features a river and is good for all skill levels. The trail is primarily used for walking, running, and road biking and is accessible year-round.",
  "length": "32.6 mi",
  "elevationGain": "196 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Coolidge to Vista Del Valle to Hogback to Riverside Loop",
  "allTrailsURI": "/trail/us/california/coolidge-to-vista-del-valle-to-hogback-to-riverside-loop",
  "overview": "Coolidge to Vista Del Valle to Hogback to Riverside Loop is a 4.3 mile heavily trafficked loop trail located near Los Angeles, California that offers scenic views and is rated as moderate. The trail is primarily used for hiking, walking, trail running, and nature trips and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.3 mi",
  "elevationGain": "1,033 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Stocker Corridor Trail",
  "allTrailsURI": "/trail/us/california/stocker-corridor-trail",
  "overview": "Stocker Corridor Trail is a 2.8 mile moderately trafficked out and back trail located near Los Angeles, California that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for hiking and running and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.8 mi",
  "elevationGain": "308 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Orcutt Ranch Horticulture Center Trail",
  "allTrailsURI": "/trail/us/california/orcutt-ranch-horticulture-center-trail",
  "overview": "Orcutt Ranch Horticulture Center Trail is a 0.5 mile lightly trafficked loop trail located near Los Angeles, California that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail.",
  "length": "0.5 mi",
  "elevationGain": "19 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Bryce Trail",
  "allTrailsURI": "/trail/us/california/bryce-trail",
  "overview": "Bryce Trail  is a 1.2 mile lightly trafficked loop trail located near Los Angeles, California that offers the chance to see wildlife and is good for all skill levels. The trail is primarily used for hiking and walking and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.2 mi",
  "elevationGain": "200 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Elysian Park Short Loop",
  "allTrailsURI": "/trail/us/california/elysian-park",
  "overview": "Elysian Park Short Loop is a 1.9 mile moderately trafficked loop trail located near Los Angeles, California that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round.",
  "length": "1.9 mi",
  "elevationGain": "275 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "La Tuna Canyon Trail to Verdugo Crest Trail Loop",
  "allTrailsURI": "/trail/us/california/la-tuna-canyon-trail-to-verdugo-crest-trail-loop",
  "overview": "La Tuna Canyon Trail to Verdugo Crest Trail Loop is a 6.4 mile loop trail located near Los Angeles, California that offers the chance to see wildlife and is rated as difficult. The trail is primarily used for hiking, walking, trail running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "6.4 mi",
  "elevationGain": "2,083 ft",
  "routeType": "Loop",
  "difficulty": "hard",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Beacon Hill Loop Trail",
  "allTrailsURI": "/trail/us/california/beacon-hill-loop-trail",
  "overview": "Beacon Hill Loop Trail is a 2.5 mile lightly trafficked loop trail located near Los Angeles, California that features a river and is rated as moderate. The trail is primarily used for hiking, walking, trail running, and nature trips and is accessible year-round. Dogs are also able to use this trail.",
  "length": "2.5 mi",
  "elevationGain": "620 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Hollywood Reservoir to the Hollywood Sign",
  "allTrailsURI": "/trail/us/california/hollywood-reservoir-to-the-hollywood-sign",
  "overview": "Hollywood Reservoir to the Hollywood Sign is a 6.6 mile heavily trafficked out and back trail located near Los Angeles, California that features a lake and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Horses are also able to use this trail.",
  "length": "6.6 mi",
  "elevationGain": "593 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Rock Point Overlook Trail",
  "allTrailsURI": "/trail/us/california/rock-point-overlook-trail",
  "overview": "Rock Point Overlook Trail is a 6 mile loop trail located near Los Angeles, California that offers scenic views and is rated as moderate. The trail is primarily used for hiking and running. Dogs are also able to use this trail.",
  "length": "6.0 mi",
  "elevationGain": "1,660 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Hectic Trail to Sullivan Canyon Loop",
  "allTrailsURI": "/trail/us/california/hectic-trail-to-sullivan-canyon-loop",
  "overview": "Hectic Trail to Sullivan Canyon Loop is a 10.6 mile loop trail located near Los Angeles, California that features a great forest setting. The trail is rated as moderate and is primarily used for hiking, walking, running, and nature trips.",
  "length": "10.6 mi",
  "elevationGain": "2,332 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mission Point via Bee Canyon and Decampos Trail Loop",
  "allTrailsURI": "/trail/us/california/mission-point-via-bee-canyon-and-decampos-trail-loop",
  "overview": "Mission Point via Bee Canyon and Decampos Trail Loop is a 5.4 mile moderately trafficked loop trail located near Los Angeles, California that offers the chance to see wildlife. The trail is rated as moderate and is primarily used for hiking, running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "5.4 mi",
  "elevationGain": "1,492 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Caballero Canyon to San Vicente Mountain",
  "allTrailsURI": "/trail/us/california/caballero-canyon-to-san-vicente-mountain",
  "overview": "Caballero Canyon to San Vicente Mountain is a 7.9 mile moderately trafficked out and back trail located near Los Angeles, California that offers scenic views and is rated as moderate. The trail is primarily used for hiking, walking, nature trips, and bird watching and is accessible year-round.",
  "length": "7.9 mi",
  "elevationGain": "1,154 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Main Trail to Lower Beacon Trail",
  "allTrailsURI": "/trail/us/california/main-trail-to-lower-beacon-trail",
  "overview": "Main Trail to Lower Beacon Trail  is a 3 mile moderately trafficked loop trail located near Los Angeles, California and is good for all skill levels. The trail is primarily used for hiking and walking and is accessible year-round.",
  "length": "3.0 mi",
  "elevationGain": "406 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 9,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Central Park East and West Drive Loop",
  "allTrailsURI": "/trail/us/new-york/central-park-east-and-west-drive-loop",
  "overview": "Central Park: East and West Drive Loop is a 6.1 mile heavily trafficked loop trail located near New York City, New York that features a lake and is rated as moderate. The trail is primarily used for walking, running, bird watching, and road biking and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "6.1 mi",
  "elevationGain": "285 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Manhattan Central Park Trail",
  "allTrailsURI": "/trail/us/new-york/manhattan-central-park-trail",
  "overview": "Manhattan: Central Park Trail is a 3.7 mile heavily trafficked point-to-point trail located near New York City, New York that features a lake and is good for all skill levels. The trail is primarily used for walking, running, and road biking and is accessible year-round. Dogs are also able to use this trail.",
  "length": "3.7 mi",
  "elevationGain": "164 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Prospect Park Loop",
  "allTrailsURI": "/trail/us/new-york/prospect-park-loop",
  "overview": "Prospect Park Loop is a 3.7 mile heavily trafficked loop trail located near New York City, New York that features a lake and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.7 mi",
  "elevationGain": "134 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Brooklyn Bridge Walk via Manhattan",
  "allTrailsURI": "/trail/us/new-york/brooklyn-bridge-walk",
  "overview": "Brooklyn Bridge Walk via Manhattan is a 2.4 mile heavily trafficked out and back trail located near New York City, New York that features a river and is good for all skill levels. The trail is primarily used for hiking, walking, and running. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.4 mi",
  "elevationGain": "98 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Forest Park Loop",
  "allTrailsURI": "/trail/us/new-york/forest-park-loop",
  "overview": "Forest Park Loop is a 2.3 mile heavily trafficked loop trail located near New York City, New York that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is best used from March until November. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.3 mi",
  "elevationGain": "131 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Alley Pond Park Loop",
  "allTrailsURI": "/trail/us/new-york/alley-pond",
  "overview": "Alley Pond Park Loop is a 3.2 mile moderately trafficked loop trail located near New York City, New York that features a great forest setting. The trail is rated as moderate and is primarily used for hiking, walking, running, and nature trips.",
  "length": "3.2 mi",
  "elevationGain": "219 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Long Path Trail",
  "allTrailsURI": "/trail/us/new-york/long-path-trail--2",
  "overview": "Long Path Trail is a 424 mile moderately trafficked point-to-point trail located near New York City, New York that features a great forest setting and is rated as difficult. The trail is primarily used for hiking, nature trips, and bird watching and is best used from April until September.",
  "length": "424.0 mi",
  "elevationGain": "68,077 ft",
  "routeType": "Point to Point",
  "difficulty": "hard",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "High Line Park",
  "allTrailsURI": "/trail/us/new-york/high-line-park",
  "overview": "High Line Park is a 1.5 mile heavily trafficked point-to-point trail located near New York City, New York that features a river and is good for all skill levels. The trail is primarily used for walking and is accessible year-round.",
  "length": "1.5 mi",
  "elevationGain": "9 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Hudson River Greenway Battery Park to Riverside Park",
  "allTrailsURI": "/trail/us/new-york/hudson-river-greenway-battery-park-to-riverside-park",
  "overview": "Hudson River Greenway: Battery Park to Riverside Park is a 5.4 mile heavily trafficked point-to-point trail located near New York City, New York that features a river and is good for all skill levels. The trail is primarily used for walking, running, and road biking and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "5.4 mi",
  "elevationGain": "75 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Staten Island Greenbelt Trail",
  "allTrailsURI": "/trail/us/new-york/staten-island-greenbelt-trail",
  "overview": "Staten Island Greenbelt Trail is a 3.4 mile heavily trafficked loop trail located near New York City, New York that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.4 mi",
  "elevationGain": "272 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Van Cortlandt Park Trail",
  "allTrailsURI": "/trail/us/new-york/van-cortlandt-park-trail",
  "overview": "Van Cortlandt Park Trail is a 10.1 mile moderately trafficked loop trail located near New York City, New York that features a lake and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail.",
  "length": "10.1 mi",
  "elevationGain": "544 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Jacqueline Kennedy Onassis Reservoir Running Path",
  "allTrailsURI": "/trail/us/new-york/jacqueline-kennedy-onassis-reservoir-running-path",
  "overview": "Jacqueline Kennedy Onassis Reservoir Running Path is a 1.7 mile heavily trafficked loop trail located near New York City, New York that features a lake and is good for all skill levels. The trail offers a number of activity options and is accessible year-round.",
  "length": "1.7 mi",
  "elevationGain": "29 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Inwood Hill Park Trail",
  "allTrailsURI": "/trail/us/new-york/inwood-hill-park-trail",
  "overview": "Inwood Hill Park Trail is a 1.8 mile moderately trafficked loop trail located near New York City, New York that features a great forest setting and is good for all skill levels. The trail is primarily used for walking, running, and road biking and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.8 mi",
  "elevationGain": "282 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Staten Island Greenbelt White Trail",
  "allTrailsURI": "/trail/us/new-york/staten-island-greenbelt-white-trail",
  "overview": "Staten Island Greenbelt White Trail is a 7.1 mile lightly trafficked point-to-point trail located near New York City, New York that features a lake and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "7.1 mi",
  "elevationGain": "298 ft",
  "routeType": "Point to Point",
  "difficulty": "moderate",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Fort Washington Park Greenway",
  "allTrailsURI": "/trail/us/new-york/fort-washington-park-greenway",
  "overview": "Fort Washington Park Greenway is a 8 mile moderately trafficked out and back trail located near New York City, New York that features a river and is good for all skill levels. The trail offers a number of activity options and is accessible year-round.",
  "length": "8.0 mi",
  "elevationGain": "469 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Central Park North Woods Trail",
  "allTrailsURI": "/trail/us/new-york/central-park-north-woods-trail",
  "overview": "Central Park North Woods Trail is a 3.7 mile heavily trafficked loop trail located near New York City, New York that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is best used from January until March. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.7 mi",
  "elevationGain": "219 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Cross Bay and West Pond Loop Trail",
  "allTrailsURI": "/trail/us/new-york/cross-bay-and-west-pond-loop-trail",
  "overview": "Cross Bay and West Pond Loop Trail is a 4.2 mile moderately trafficked loop trail located near New York City, New York that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round.",
  "length": "4.2 mi",
  "elevationGain": "52 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "North Woods",
  "allTrailsURI": "/trail/us/new-york/north-woods",
  "overview": "North Woods is a 3.8 mile moderately trafficked loop trail located near New York City, New York that offers scenic views and is rated as moderate. The trail offers a number of activity options and is best used from May until September.",
  "length": "3.8 mi",
  "elevationGain": "219 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Fort Tryon and Inwood Hill Parks",
  "allTrailsURI": "/trail/us/new-york/fort-tryon-and-ironwood-hill-parks",
  "overview": "Fort Tryon and Ironwood Hill Parks is a 3.7 mile loop trail located near New York City, New York that offers scenic views and is good for all skill levels. The trail is primarily used for walking, running, and nature trips.",
  "length": "3.7 mi",
  "elevationGain": "423 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "George Washington Bridge",
  "allTrailsURI": "/trail/us/new-york/george-washington-bridge",
  "overview": "George Washington Bridge is a 1.6 mile moderately trafficked point-to-point trail located near New York City, New York that offers scenic views and is good for all skill levels. The trail is primarily used for hiking and walking and is best used from April until September.",
  "length": "1.6 mi",
  "elevationGain": "295 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Brooklyn Bridge Walk via Brooklyn",
  "allTrailsURI": "/trail/us/new-york/brooklyn-bridge-walk-via-brooklyn",
  "overview": "Brooklyn Bridge Walk via Brooklyn is a 1.1 mile point-to-point trail located near New York City, New York that offers scenic views. The trail is good for all skill levels and is primarily used for hiking and walking.",
  "length": "1.1 mi",
  "elevationGain": "29 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Ridgewood Reservoir",
  "allTrailsURI": "/trail/us/new-york/ridgewood-reservoir",
  "overview": "Ridgewood Reservoir is a 2.3 mile heavily trafficked loop trail located near New York City, New York that features a lake and is good for all skill levels. The trail is primarily used for hiking, walking, running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.3 mi",
  "elevationGain": "49 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Joe Michaels Mile",
  "allTrailsURI": "/trail/us/new-york/joe-michaels-mile",
  "overview": "Joe Michaels Mile is a 5 mile heavily trafficked out and back trail located near New York City, New York that offers scenic views and is good for all skill levels. The trail is primarily used for walking, running, and road biking. Dogs are also able to use this trail.",
  "length": "5.0 mi",
  "elevationGain": "82 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Hutchinson River Parkway Trails",
  "allTrailsURI": "/trail/us/new-york/hutchinson-river-parkway-trails",
  "overview": "Hutchinson River Parkway Trails is a 2.1 mile moderately trafficked loop trail located near New York City, New York that features a lake and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail.",
  "length": "2.1 mi",
  "elevationGain": "82 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 10,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Wissahickon Creek Gorge Loop Trail",
  "allTrailsURI": "/trail/us/pennsylvania/wissahickon-creek-gorge-loop-trail",
  "overview": "Wissahickon Creek Gorge Loop Trail is a 9.2 mile heavily trafficked loop trail located near Philadelphia, Pennsylvania that features a waterfall and is good for all skill levels. The trail offers a number of activity options and is best used from April until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "9.2 mi",
  "elevationGain": "643 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Schuylkill River Trail Philadelphia to Valley Forge",
  "allTrailsURI": "/trail/us/pennsylvania/schuykill-river-trail",
  "overview": "Schuylkill River Trail: Philadelphia to Valley Forge is a 24.6 mile heavily trafficked point-to-point trail located near Philadelphia, Pennsylvania that features a river and is good for all skill levels. The trail offers a number of activity options and is best used from March until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "24.6 mi",
  "elevationGain": "521 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lincoln Drive Trail",
  "allTrailsURI": "/trail/us/pennsylvania/lincoln-drive-trail",
  "overview": "Lincoln Drive Trail  is a 4.3 mile heavily trafficked loop trail located near Philadelphia, Pennsylvania that features a waterfall and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.3 mi",
  "elevationGain": "347 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Wissahickon Park Orange Trail to White Trail",
  "allTrailsURI": "/trail/us/pennsylvania/wissahickon-park-orange-trail-to-white-trail",
  "overview": "Wissahickon Park Orange Trail to White Trail is a 3.6 mile heavily trafficked loop trail located near Philadelphia, Pennsylvania that features a great forest setting and is rated as moderate. The trail is primarily used for hiking, walking, running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.6 mi",
  "elevationGain": "426 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Wissahickon Creek Loop Yellow Trail",
  "allTrailsURI": "/trail/us/pennsylvania/wissahickon-creek-loop-yellow-trail",
  "overview": "Wissahickon Creek Loop Yellow Trail is a 5.8 mile moderately trafficked loop trail located near Philadelphia, Pennsylvania that features a river and is rated as moderate. The trail offers a number of activity options. Dogs are also able to use this trail but must be kept on leash.",
  "length": "5.8 mi",
  "elevationGain": "616 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Trolley Trail",
  "allTrailsURI": "/trail/us/pennsylvania/trolley-trail",
  "overview": "Trolley Trail is a 5 mile moderately trafficked loop trail located near Philadelphia, Pennsylvania that features a river and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Horses are also able to use this trail.",
  "length": "5.0 mi",
  "elevationGain": "360 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Blue Bell and Forbidden Drive Loop",
  "allTrailsURI": "/trail/us/pennsylvania/blue-bell-forbidden-drive",
  "overview": "Blue Bell and Forbidden Drive Loop is a 2.1 mile moderately trafficked loop trail located near Philadelphia, Pennsylvania that features a river and is good for all skill levels. The trail offers a number of activity options and is best used from April until October.",
  "length": "2.1 mi",
  "elevationGain": "219 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Wissahickon Bikeway",
  "allTrailsURI": "/trail/us/pennsylvania/wissahickon-bikeway",
  "overview": "Wissahickon Bikeway is a 2.6 mile out and back trail located near Philadelphia, Pennsylvania that features a great forest setting. The trail is rated as moderate and offers a number of activity options.",
  "length": "2.6 mi",
  "elevationGain": "82 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Wissahickon Creek Short Loop",
  "allTrailsURI": "/trail/us/pennsylvania/wissahickon-creek-short-loop",
  "overview": "Wissahickon Creek Short Loop is a 2.1 mile moderately trafficked loop trail located near Philadelphia, Pennsylvania that features a river and is good for all skill levels. The trail offers a number of activity options and is best used from April until September. Dogs are also able to use this trail.",
  "length": "2.1 mi",
  "elevationGain": "318 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Cynwyd Heritage Trail from Manayunk",
  "allTrailsURI": "/trail/us/pennsylvania/cynwyd-heritage-trail-from-manayunk",
  "overview": "Cynwyd Heritage Trail from Manayunk is a 3.5 mile moderately trafficked out and back trail located near Philadelphia, Pennsylvania that features a river and is good for all skill levels. The trail is primarily used for walking, trail running, and road biking and is best used from March until November. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.5 mi",
  "elevationGain": "318 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Orange Trail Yellow Trail Wissahickon Bikeway",
  "allTrailsURI": "/trail/us/pennsylvania/orange-trail-yellow-trail-wissahickon-bikeway",
  "overview": "Orange Trail - Yellow Trail - Wissahickon Bikeway is a 19.6 mile moderately trafficked loop trail located near Philadelphia, Pennsylvania that features a river and is rated as moderate. The trail is primarily used for hiking, walking, running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "19.6 mi",
  "elevationGain": "2,063 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Forbidden Drive",
  "allTrailsURI": "/trail/us/pennsylvania/forbidden-drive",
  "overview": "Forbidden Drive is a 5.3 mile point-to-point trail located near Philadelphia, Pennsylvania that features a river and is good for all skill levels. The trail is primarily used for walking, trail running, and mountain biking.",
  "length": "5.3 mi",
  "elevationGain": "127 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Andorra Meadow Trail",
  "allTrailsURI": "/trail/us/pennsylvania/andorra-meadow-trail",
  "overview": "Andorra Meadow Trail is a 2.1 mile moderately trafficked loop trail located near Philadelphia, Pennsylvania that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.1 mi",
  "elevationGain": "144 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Margaree Dam White Orange and Forbidden Drive Loop",
  "allTrailsURI": "/trail/us/pennsylvania/margaree-dam-white-orange-and-forbidden-drive-loop",
  "overview": "Margaree Dam White, Orange, and Forbidden Drive Loop  is a 3.2 mile moderately trafficked loop trail located near Philadelphia, Pennsylvania that features a river and is good for all skill levels. The trail is primarily used for hiking, walking, running, and bird watching. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.2 mi",
  "elevationGain": "187 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lorimer Park Loop",
  "allTrailsURI": "/trail/us/pennsylvania/lorimer-park-loop",
  "overview": "Lorimer Park Loop is a 3.9 mile moderately trafficked loop trail located near Philadelphia, Pennsylvania that offers the chance to see wildlife and is good for all skill levels. The trail offers a number of activity options. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.9 mi",
  "elevationGain": "387 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Wissahickon Creek Loop from Hermit Lane",
  "allTrailsURI": "/trail/us/pennsylvania/wissahickon-creek-loop-from-hermit-lane",
  "overview": "Wissahickon Creek Loop from Hermit Lane is a 1.5 mile heavily trafficked loop trail located near Philadelphia, Pennsylvania that features a river and is good for all skill levels. The trail is primarily used for walking, trail running, and nature trips and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.5 mi",
  "elevationGain": "242 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Orange Trail to Lavender Trail to Forbidden Drive",
  "allTrailsURI": "/trail/us/pennsylvania/orange-trail-to-lavender-trail-to-forbidden-drive",
  "overview": "Orange Trail to Lavender Trail to Forbidden Drive is a 2.1 mile moderately trafficked loop trail located near Philadelphia, Pennsylvania that features a great forest setting and is good for all skill levels. The trail is primarily used for hiking, walking, running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.1 mi",
  "elevationGain": "213 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Guide to Historical Philadelphia",
  "allTrailsURI": "/trail/us/pennsylvania/guide-to-historical-philadelphia",
  "overview": "Guide to Historical Philadelphia is a 1.6 mile moderately trafficked loop trail located near Philadelphia, Pennsylvania that offers scenic views and is good for all skill levels. The trail is primarily used for walking and is accessible year-round.",
  "length": "1.6 mi",
  "elevationGain": "22 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Ravine and Gray Fox Trails Loop",
  "allTrailsURI": "/trail/us/pennsylvania/ravine-and-gray-fox-trails-loop",
  "overview": "Ravine and Gray Fox Trails Loop is a 2.2 mile moderately trafficked loop trail located near Philadelphia, Pennsylvania that features a lake and is good for all skill levels. The trail is primarily used for walking and nature trips and is accessible year-round.",
  "length": "2.2 mi",
  "elevationGain": "364 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Pennypack Park Trail South Side",
  "allTrailsURI": "/trail/us/pennsylvania/pennypack-park-trail-south-side",
  "overview": "Pennypack Park Trail South Side is a 3.8 mile lightly trafficked loop trail located near Philadelphia, Pennsylvania that features a river and is good for all skill levels. The trail is primarily used for hiking, walking, running, and bird watching.",
  "length": "3.8 mi",
  "elevationGain": "118 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Wissahickon Yellow Loop via Hermit Lane",
  "allTrailsURI": "/trail/us/pennsylvania/wissahickon-yellow-loop-via-hermit-lane",
  "overview": "Wissahickon Yellow Loop via Hermit Lane is a 1.4 mile lightly trafficked loop trail located near Philadelphia, Pennsylvania that offers scenic views and is good for all skill levels. The trail is primarily used for hiking and mountain biking. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.4 mi",
  "elevationGain": "200 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Pine Run Preamble",
  "allTrailsURI": "/trail/us/pennsylvania/pine-run-preamble",
  "overview": "Pine Run Preamble is a 2.4 mile moderately trafficked loop trail located near Philadelphia, Pennsylvania that offers scenic views and is good for all skill levels. The trail offers a number of activity options and is best used from April until September. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.4 mi",
  "elevationGain": "150 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Roosevelt Park Loop",
  "allTrailsURI": "/trail/us/pennsylvania/roosevelt-park-loop",
  "overview": "Roosevelt Park Loop is a 1.8 mile moderately trafficked loop trail located near Philadelphia, Pennsylvania that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round.",
  "length": "1.8 mi",
  "elevationGain": "19 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Benjamin Rush State Park Trail",
  "allTrailsURI": "/trail/us/pennsylvania/benjamin-rush-state-park-trail",
  "overview": "Benjamin Rush State Park Trail is a 2.9 mile moderately trafficked loop trail located near Philadelphia, Pennsylvania that features a river and is good for all skill levels. The trail is primarily used for hiking, walking, nature trips, and bird watching.",
  "length": "2.9 mi",
  "elevationGain": "68 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 11,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lower Macleay Park to Pittock Mansion",
  "allTrailsURI": "/trail/us/oregon/lower-macleay-park-to-pittock-mansion",
  "overview": "Lower Macleay Park to Pittock Mansion is a 5 mile heavily trafficked out and back trail located near Portland, Oregon that features a river and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "5.0 mi",
  "elevationGain": "921 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Wildwood Trail",
  "allTrailsURI": "/trail/us/oregon/wildwood-trail--4",
  "overview": "Wildwood Trail is a 29.6 mile heavily trafficked point-to-point trail located near Portland, Oregon that features beautiful wild flowers and is rated as difficult. The trail is primarily used for hiking, running, nature trips, and bird watching and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "29.6 mi",
  "elevationGain": "2,772 ft",
  "routeType": "Point to Point",
  "difficulty": "hard",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Tryon Creek Triple Bridge Loop",
  "allTrailsURI": "/trail/us/oregon/tryon-triple-bridge",
  "overview": "Tryon Creek Triple Bridge Loop is a 3.5 mile heavily trafficked loop trail located near Portland, Oregon that features a river and is rated as moderate. The trail is primarily used for hiking, running, and bird watching and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.5 mi",
  "elevationGain": "541 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Marquam Trail to Council Crest Hike Trail",
  "allTrailsURI": "/trail/us/oregon/marquam-trail-to-council-crest-hike-trail",
  "overview": "Marquam Trail to Council Crest Hike Trail is a 3.1 mile heavily trafficked out and back trail located near Portland, Oregon that features a river and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.1 mi",
  "elevationGain": "748 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Hoyt Arboretum Trails",
  "allTrailsURI": "/trail/us/oregon/hoyt-arboretum-trails",
  "overview": "Hoyt Arboretum Trails is a 1.3 mile heavily trafficked loop trail located near Portland, Oregon that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for hiking, walking, running, and bird watching and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.3 mi",
  "elevationGain": "213 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mount Tabor Loop Trail",
  "allTrailsURI": "/trail/us/oregon/mount-tabor-loop-trail",
  "overview": "Mount Tabor Loop Trail is a 1.5 mile heavily trafficked loop trail located near Portland, Oregon that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is best used from March until December. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.5 mi",
  "elevationGain": "246 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Wildwood Trail and Leif Erickson Drive Trail Loop",
  "allTrailsURI": "/trail/us/oregon/wildwood-trail-and-leif-erickson-drive-trail-loop",
  "overview": "Wildwood Trail and Leif Erickson Drive Trail Loop is a 4.3 mile heavily trafficked loop trail located near Portland, Oregon that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.3 mi",
  "elevationGain": "479 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Washington Park Loop",
  "allTrailsURI": "/trail/us/oregon/washington-park-loop",
  "overview": "Washington Park Loop is a 4 mile heavily trafficked loop trail located near Portland, Oregon that features a great forest setting and is good for all skill levels. The trail is primarily used for hiking, walking, nature trips, and mountain biking and is best used from April until September. Dogs are also able to use this trail.",
  "length": "4.0 mi",
  "elevationGain": "393 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Forest Park Ridge Trail",
  "allTrailsURI": "/trail/us/oregon/forest-park-ridge-trail",
  "overview": "Forest Park Ridge Trail is a 3 mile heavily trafficked out and back trail located near Portland, Oregon that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.0 mi",
  "elevationGain": "862 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Pittock Mansion via Upper Macleay and Wildwood Trail",
  "allTrailsURI": "/trail/us/oregon/pittock-mansion-via-wildwood-trail",
  "overview": "Pittock Mansion via Upper Macleay and Wildwood Trail  is a 2.7 mile heavily trafficked loop trail located near Portland, Oregon that offers the chance to see wildlife and is good for all skill levels. The trail is primarily used for hiking, walking, running, and bird watching. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.7 mi",
  "elevationGain": "518 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Marshall Park Trail",
  "allTrailsURI": "/trail/us/oregon/marshall-park-trail",
  "overview": "Marshall Park Trail is a 1.9 mile heavily trafficked loop trail located near Portland, Oregon that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is best used from March until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.9 mi",
  "elevationGain": "236 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Skyline Cruise Loop Trail",
  "allTrailsURI": "/trail/us/oregon/skyline-cruise-loop-trail",
  "overview": "Skyline Cruise Loop Trail is a 2.8 mile heavily trafficked loop trail located near Portland, Oregon that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs and horses are also able to use this trail.",
  "length": "2.8 mi",
  "elevationGain": "501 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Springwater on the Willamette North Woodland and Bluff Trail Loop",
  "allTrailsURI": "/trail/us/oregon/springwater-on-the-wilamette-north-woodland-and-bluff-trail-loop",
  "overview": "Springwater on the Willamette, North Woodland and Bluff Trail Loop is a 3.1 mile heavily trafficked loop trail located near Portland, Oregon that features a lake and is good for all skill levels. The trail offers a number of activity options and is best used from May until November. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.1 mi",
  "elevationGain": "219 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Powell Butte Loop Trail",
  "allTrailsURI": "/trail/us/oregon/powell-butte-loop-trail--2",
  "overview": "Powell Butte Loop Trail is a 6.2 mile heavily trafficked loop trail located near Portland, Oregon that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, running, nature trips, and mountain biking and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "6.2 mi",
  "elevationGain": "951 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Wildwood Loop Trail",
  "allTrailsURI": "/trail/us/oregon/wildwood-loop-trail",
  "overview": "Wildwood Loop Trail is a 3.7 mile heavily trafficked loop trail located near Portland, Oregon that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is best used from March until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.7 mi",
  "elevationGain": "416 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Balch Creek Wildwood Trail Loop",
  "allTrailsURI": "/trail/us/oregon/balch-creek-wildwood-trail-loop",
  "overview": "Balch Creek & Wildwood Trail Loop is a 4.9 mile heavily trafficked loop trail located near Portland, Oregon that features a river and is rated as moderate. The trail is primarily used for hiking, walking, and trail running and is best used from March until April. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.9 mi",
  "elevationGain": "790 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Wild Cherry Wildwood Alder Dogwood Loop via Leif Erikson Drive",
  "allTrailsURI": "/trail/us/oregon/wild-cherry-wildwood-alder-dogwood-loop-via-leif-erikson-drive",
  "overview": "Wild Cherry, Wildwood, Alder, Dogwood Loop via Leif Erikson Drive is a 5.7 mile heavily trafficked loop trail located near Portland, Oregon that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is best used from February until November. Dogs are also able to use this trail but must be kept on leash.",
  "length": "5.7 mi",
  "elevationGain": "921 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Dogwood Wild Cherry Loop Trail",
  "allTrailsURI": "/trail/us/oregon/dogwood-wild-cherry-loop-trail",
  "overview": "Dogwood Wild Cherry Loop Trail is a 2.5 mile heavily trafficked loop trail located near Portland, Oregon that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.5 mi",
  "elevationGain": "505 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Eastbank Esplanade Loop Trail",
  "allTrailsURI": "/trail/us/oregon/eastbank-esplanade-loop-trail",
  "overview": "Eastbank Esplanade Loop Trail is a 2.5 mile heavily trafficked loop trail located near Portland, Oregon that features a river and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.5 mi",
  "elevationGain": "111 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Waterline Trail",
  "allTrailsURI": "/trail/us/oregon/waterline-trail",
  "overview": "Waterline Trail is a 3.3 mile heavily trafficked out and back trail located near Portland, Oregon that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is best used from March until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.3 mi",
  "elevationGain": "843 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Maple and Wildwood Trail Loop",
  "allTrailsURI": "/trail/us/oregon/maple-and-wildwood-trail-loop",
  "overview": "Maple and Wildwood Trail Loop is a 6.3 mile moderately trafficked loop trail located near Portland, Oregon that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, walking, running, and nature trips and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "6.3 mi",
  "elevationGain": "866 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Wildwood Trail and Lower Macleay Trail Loop",
  "allTrailsURI": "/trail/us/oregon/wildwood-trail-and-lower-macleay-trail-loop",
  "overview": "Wildwood Trail and Lower Macleay Trail Loop is a 3.2 mile moderately trafficked loop trail located near Portland, Oregon that offers the chance to see wildlife. The trail is good for all skill levels and is primarily used for hiking, walking, and running. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.2 mi",
  "elevationGain": "551 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Wildhorse Trail Orchard Loop Pioneer Orchard Cedar Grove Elderberry Old Holgate Trail",
  "allTrailsURI": "/trail/us/oregon/wildhorse-trail-orchard-loop-pioneer-orchard-cedar-grove-elderberry-old-holgate-trail",
  "overview": "Wildhorse Trail, Orchard Loop, Pioneer Orchard, Cedar Grove, Elderberry, Old Holgate Trail is a 4.1 mile heavily trafficked loop trail located near Portland, Oregon that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is best used from May until September.",
  "length": "4.1 mi",
  "elevationGain": "554 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Pittock Mansion via Wildwood Trail",
  "allTrailsURI": "/trail/us/oregon/pittock-mansion-via-wildwood-trail--2",
  "overview": "Pittock Mansion via Wildwood Trail is a 6.2 mile moderately trafficked out and back trail located near Portland, Oregon that offers the chance to see wildlife and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "6.2 mi",
  "elevationGain": "954 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Ridge Trail to Wildwood Loop",
  "allTrailsURI": "/trail/us/oregon/ridge-trail-to-wildwood-loop",
  "overview": "Ridge Trail to Wildwood Loop is a 4.4 mile moderately trafficked loop trail located near Portland, Oregon that offers the chance to see wildlife. The trail is rated as moderate and primarily used for hiking and trail running. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.4 mi",
  "elevationGain": "1,040 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Firelanes and Loop",
  "allTrailsURI": "/trail/us/oregon/firelanes-1-and-3-loop",
  "overview": "Firelanes 1 and 3 Loop is a 8.4 mile moderately trafficked loop trail located near Portland, Oregon that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "8.4 mi",
  "elevationGain": "1,033 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Wildwood Stair Trail",
  "allTrailsURI": "/trail/us/oregon/wildwood-stair-climb",
  "overview": "Wildwood Stair Trail is a 0.3 mile heavily trafficked out and back trail located near Portland, Oregon and is good for all skill levels. The trail is primarily used for hiking.",
  "length": "0.3 mi",
  "elevationGain": "13 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Leif Erikson Drive Firelane Trail Southern Loop",
  "allTrailsURI": "/trail/us/oregon/leif-erikson-drive-firelane-1-trail-southern-loop",
  "overview": "Leif Erikson Drive Firelane 1 Trail (Southern Loop) is a 6.9 mile moderately trafficked loop trail located near Portland, Oregon that features a great forest setting and is rated as moderate. The trail offers a number of activity options and is best used from March until November. Dogs are also able to use this trail but must be kept on leash.",
  "length": "6.9 mi",
  "elevationGain": "1,023 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Old Main Trail to Cedar Trail and West Horse Loop",
  "allTrailsURI": "/trail/us/oregon/old-man-trail-to-cedar-trail-and-west-horse-loop",
  "overview": "Old Main Trail to Cedar Trail and West Horse Loop  is a 2 mile moderately trafficked loop trail located near Portland, Oregon that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, walking, nature trips, and bird watching and is best used from April until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.0 mi",
  "elevationGain": "265 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Tualatin River Trail",
  "allTrailsURI": "/trail/us/oregon/tualatin-river-trail",
  "overview": "Tualatin River Trail is a 4.8 mile moderately trafficked out and back trail located near Portland, Oregon that features a river and is good for all skill levels. The trail is primarily used for hiking, walking, and running and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.8 mi",
  "elevationGain": "114 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Linnton Trail",
  "allTrailsURI": "/trail/us/oregon/linnton-trail",
  "overview": "Linnton Trail is a 3 mile moderately trafficked loop trail located near Portland, Oregon that offers the chance to see wildlife and is rated as moderate. The trail offers a number of activity options and is best used from March until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.0 mi",
  "elevationGain": "830 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Old Main Cedar Terwilliger and North Horse Loop",
  "allTrailsURI": "/trail/us/oregon/old-main-cedar-terwilliger-and-north-horse-loop",
  "overview": "Old Main, Cedar, Terwilliger and North Horse Loop  is a 4.2 mile moderately trafficked loop trail located near Portland, Oregon that features a river and is rated as moderate. The trail is primarily used for hiking, walking, and nature trips and is accessible year-round.",
  "length": "4.2 mi",
  "elevationGain": "479 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Newberry Loop Trail",
  "allTrailsURI": "/trail/us/oregon/newberry-loop-trail",
  "overview": "Newberry Loop Trail is a 9.1 mile moderately trafficked loop trail located near Portland, Oregon that features a great forest setting and is rated as moderate. The trail is primarily used for hiking, walking, running, and nature trips and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "9.1 mi",
  "elevationGain": "1,154 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Vietnam Veterans Memorial and the World Forestry Center",
  "allTrailsURI": "/trail/us/oregon/vietnam-veterans-memorial-and-the-world-forestry-center",
  "overview": "Vietnam Veterans Memorial and the World Forestry Center is a 0.3 mile moderately trafficked loop trail located near Portland, Oregon and is good for all skill levels. The trail is primarily used for walking, nature trips, and birding and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "0.3 mi",
  "elevationGain": "6 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Tunnel Trail to Wildwood Trail",
  "allTrailsURI": "/trail/us/oregon/tunnel-trail-to-wildwood-trail",
  "overview": "Tunnel Trail to Wildwood Trail is a 1.8 mile moderately trafficked out and back trail located near Portland, Oregon that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is best used from April until September. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.8 mi",
  "elevationGain": "551 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Hawthorn and Douglas Fir Trail Loop",
  "allTrailsURI": "/trail/us/oregon/hawthorn-and-douglas-fir-trail-loop",
  "overview": "Hawthorn and Douglas Fir Trail Loop is a 1.8 mile moderately trafficked loop trail located near Portland, Oregon that features a great forest setting and is good for all skill levels. The trail offers a number of activity options. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.8 mi",
  "elevationGain": "318 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Northwest Firelane Road and Wildwood Trail Loop",
  "allTrailsURI": "/trail/us/oregon/northwest-firelane-7-road-and-wildwood-trail-loop",
  "overview": "Northwest Firelane 7 Road and Wildwood Trail Loop is a 4.4 mile moderately trafficked loop trail located near Portland, Oregon that features a river and is rated as moderate. The trail is primarily used for hiking, nature trips, and bird watching and is best used from March until October.",
  "length": "4.4 mi",
  "elevationGain": "413 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "NW Leif Erickson Dogwood Wildwood and Aspen Trail Loop",
  "allTrailsURI": "/trail/us/oregon/leif-erickson-dogwood-wildwood-aspen-loop",
  "overview": "NW Leif Erickson, Dogwood, Wildwood, and Aspen Trail Loop is a 4 mile moderately trafficked loop trail located near Portland, Oregon that offers the chance to see wildlife and is rated as moderate. The trail is primarily used for hiking, running, nature trips, and bird watching and is best used from February until November. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.0 mi",
  "elevationGain": "488 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Wildwood and Northwest Firelane Road Loop",
  "allTrailsURI": "/trail/us/oregon/wildwood-and-northwest-firelane-7-road-loop",
  "overview": "Wildwood and Northwest Firelane 7 Road Loop is a 2.3 mile lightly trafficked loop trail located near Portland, Oregon that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for hiking, trail running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.3 mi",
  "elevationGain": "291 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Woods Memorial Natural Area",
  "allTrailsURI": "/trail/us/oregon/woods-memorial-natural-area",
  "overview": "Woods Memorial Natural Area is a 2.3 mile moderately trafficked loop trail located near Portland, Oregon that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for hiking, walking, nature trips, and birding and is best used from April until September.",
  "length": "2.3 mi",
  "elevationGain": "354 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Marine Drive Multiuse Path",
  "allTrailsURI": "/trail/us/oregon/marine-drive-multiuse-path",
  "overview": "Marine Drive Multiuse Path is a 11 mile lightly trafficked out and back trail located near Portland, Oregon that features a river and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail.",
  "length": "11.0 mi",
  "elevationGain": "108 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Alder Northwest Leif Erikson Drive and Wildwood Loop",
  "allTrailsURI": "/trail/us/oregon/alder-northwest-leif-erikson-drive-and-wildwood-loop",
  "overview": "Alder, Northwest Leif Erikson Drive and Wildwood Loop is a 2.3 mile moderately trafficked loop trail located near Portland, Oregon that offers the chance to see wildlife. The trail is good for all skill levels and is primarily used for hiking and running. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.3 mi",
  "elevationGain": "538 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Ridge Wildwood and Northwest Oil Line Loop",
  "allTrailsURI": "/trail/us/oregon/ridge-wildwood-and-northwest-oil-line-loop",
  "overview": "Ridge, Wildwood and Northwest Oil Line Loop is a 3.1 mile lightly trafficked loop trail located near Portland, Oregon that offers the chance to see wildlife. The trail is good for all skill levels and is primarily used for hiking, running, nature trips, and bird watching. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.1 mi",
  "elevationGain": "331 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Fanno Creek Regional Trail",
  "allTrailsURI": "/trail/us/oregon/fanno-creek-regional-trail",
  "overview": "Fanno Creek Regional Trail is a 2.4 mile moderately trafficked out and back trail located near Portland, Oregon that features a river and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.4 mi",
  "elevationGain": "111 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Wildwood NW Leif Erikson and Alder Loop",
  "allTrailsURI": "/trail/us/oregon/wildwood-nw-leif-erikson-alder-loop",
  "overview": "Wildwood, NW Leif Erikson and Alder Loop is a 3 mile moderately trafficked loop trail located near Portland, Oregon that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is best used from April until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.0 mi",
  "elevationGain": "413 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Forest Park Germantown Road to Newberry Road",
  "allTrailsURI": "/trail/us/oregon/forest-park-germantown-road-to-newberry-road",
  "overview": "Forest Park: Germantown Road to Newberry Road is a 10.1 mile moderately trafficked out and back trail located near Portland, Oregon that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, walking, running, and nature trips and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "10.1 mi",
  "elevationGain": "1,102 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Northwest Leif Erikson Drive",
  "allTrailsURI": "/trail/us/oregon/northwest-leif-erikson-drive",
  "overview": "Northwest Leif Erikson Drive is a 10.3 mile moderately trafficked point-to-point trail located near Portland, Oregon that offers the chance to see wildlife and is rated as moderate. The trail offers a number of activity options and is best used from February until November. Dogs are also able to use this trail but must be kept on leash.",
  "length": "10.3 mi",
  "elevationGain": "688 ft",
  "routeType": "Point to Point",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Glendover Fitness Trail Loop",
  "allTrailsURI": "/trail/us/oregon/glendover-fitness-trail-loop",
  "overview": "Glendover Fitness Trail Loop is a 2 mile heavily trafficked loop trail located near Portland, Oregon that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round.",
  "length": "2.0 mi",
  "elevationGain": "82 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Barrows Park Westside Trail",
  "allTrailsURI": "/trail/us/oregon/barrows-park-westside-trail",
  "overview": "Barrows Park Westside Trail is a 10.4 mile moderately trafficked out and back trail located near Portland, Oregon that offers scenic views and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "10.4 mi",
  "elevationGain": "1,079 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Burlington Loop",
  "allTrailsURI": "/trail/us/oregon/burlington-loop--2",
  "overview": "Burlington Loop is a 3.2 mile moderately trafficked loop trail located near Portland, Oregon that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is accessible year-round.",
  "length": "3.2 mi",
  "elevationGain": "600 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mount Tabor Outer Loop",
  "allTrailsURI": "/trail/us/oregon/mount-tabor-outer-loop",
  "overview": "Mount Tabor Outer Loop is a 1.7 mile moderately trafficked loop trail located near Portland, Oregon that features a lake. The trail is good for all skill levels and is primarily used for hiking, walking, and running. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.7 mi",
  "elevationGain": "272 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Wildwood Trail from Macleay Park",
  "allTrailsURI": "/trail/us/oregon/wildwood-trail-from-macleay-park",
  "overview": "Wildwood Trail from Macleay Park is a 10.4 mile lightly trafficked out and back trail located near Portland, Oregon that offers the chance to see wildlife. The trail is good for all skill levels and primarily used for hiking and trail running. Dogs are also able to use this trail but must be kept on leash.",
  "length": "10.4 mi",
  "elevationGain": "1,017 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "The Grotto",
  "allTrailsURI": "/trail/us/oregon/the-grotto",
  "overview": "The Grotto is a 0.8 mile moderately trafficked loop trail located near Portland, Oregon that features a great forest setting and is good for all skill levels. The trail is primarily used for walking, nature trips, and birding and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "0.8 mi",
  "elevationGain": "49 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Forest Edge Meadow Lane Douglas Fir Summit Lake Mountain View Loop",
  "allTrailsURI": "/trail/us/oregon/forest-edge-meadow-lane-douglas-fir-summit-lake-mountain-view-loop",
  "overview": "Forest Edge, Meadow Lane, Douglas Fir, Summit Lake, Mountain View Loop is a 3.7 mile moderately trafficked loop trail located near Portland, Oregon that features a great forest setting and is rated as moderate. The trail offers a number of activity options and is best used from May until September.",
  "length": "3.7 mi",
  "elevationGain": "446 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Wildwood Trail Newberry Road to Germantown Road",
  "allTrailsURI": "/trail/us/oregon/wildwood-trail-newberry-rd-to-germantown-rd",
  "overview": "Wildwood Trail: Newberry Road to Germantown Road is a 10.3 mile moderately trafficked out and back trail located near Portland, Oregon that features a great forest setting and is rated as moderate. The trail is primarily used for hiking, walking, and running and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "10.3 mi",
  "elevationGain": "1,095 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Wildwood Trail to NW Firelane Road Loop",
  "allTrailsURI": "/trail/us/oregon/wildwood-trail-to-nw-firelane-road-loop",
  "overview": "Wildwood Trail to NW Firelane Road Loop is a 7 mile moderately trafficked loop trail located near Portland, Oregon that features a great forest setting and is rated as moderate. The trail is primarily used for hiking, walking, running, and nature trips and is best used from March until November. Dogs are also able to use this trail but must be kept on leash.",
  "length": "7.0 mi",
  "elevationGain": "928 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Wildwood Northwest Leif Erikson Drive and Hardesty Trail Loop",
  "allTrailsURI": "/trail/us/oregon/wildwood-northwest-leif-erikson-drive-and-hardesty-trail-loop",
  "overview": "Wildwood, Northwest Leif Erikson Drive and Hardesty Trail Loop is a 7 mile lightly trafficked loop trail located near Portland, Oregon that offers the chance to see wildlife and is rated as moderate. The trail is primarily used for hiking and trail running. Dogs are also able to use this trail but must be kept on leash.",
  "length": "7.0 mi",
  "elevationGain": "751 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Waterfront Bike Path to Springwater Corridor Path",
  "allTrailsURI": "/trail/us/oregon/waterfront-bike-path-to-springwater-corridor-path",
  "overview": "Waterfront Bike Path to Springwater Corridor Path is a 23.9 mile moderately trafficked point-to-point trail located near Portland, Oregon that features a river and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "23.9 mi",
  "elevationGain": "718 ft",
  "routeType": "Point to Point",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "North Horse Lewis and Clark Englewood Horse and Cedar Trail Loop",
  "allTrailsURI": "/trail/us/oregon/north-horse-lewis-and-clark-englewood-horse-loop",
  "overview": "North Horse, Lewis and Clark, Englewood Horse, and Cedar Trail Loop is a 4.7 mile lightly trafficked loop trail located near Portland, Oregon that features a great forest setting and is rated as moderate. The trail is primarily used for hiking, bird watching, and horses. Horses are also able to use this trail.",
  "length": "4.7 mi",
  "elevationGain": "590 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 12,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mount Olympus Trail",
  "allTrailsURI": "/trail/us/utah/mount-olympus-trail",
  "overview": "Mount Olympus Trail [CLOSED] is a 8 mile heavily trafficked out and back trail located near Midvale, Utah that features a river and is rated as difficult. The trail is primarily used for hiking and is best used from March until October. Dogs are also able to use this trail.",
  "length": "8.0 mi",
  "elevationGain": "4,192 ft",
  "routeType": "Out & Back",
  "difficulty": "hard",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "The Living Room Lookout Trail",
  "allTrailsURI": "/trail/us/utah/the-living-room-lookout-trail",
  "overview": "The Living Room Lookout Trail is a 2.3 mile heavily trafficked out and back trail located near Salt Lake City, Utah that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is best used from March until November. Dogs are also able to use this trail.",
  "length": "2.3 mi",
  "elevationGain": "980 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lake Mary Trail",
  "allTrailsURI": "/trail/us/utah/lake-mary-trail",
  "overview": "Lake Mary Trail is a 2.6 mile heavily trafficked out and back trail located near Salt Lake City, Utah that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is best used from January until October.",
  "length": "2.6 mi",
  "elevationGain": "849 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Grandeur Peak East Trail from Church Fork",
  "allTrailsURI": "/trail/us/utah/grandeur-peak-east-trail-from-church-fork",
  "overview": "Grandeur Peak East Trail from Church Fork is a 6 mile heavily trafficked out and back trail located near Salt Lake City, Utah that features a waterfall and is rated as difficult. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "6.0 mi",
  "elevationGain": "2,627 ft",
  "routeType": "Out & Back",
  "difficulty": "hard",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lake Catherine Via Brighton Lakes Trail",
  "allTrailsURI": "/trail/us/utah/lake-catherine-via-brighton-lakes-trail",
  "overview": "Lake Catherine Via Brighton Lakes Trail is a 4.4 mile heavily trafficked out and back trail located near Salt Lake City, Utah that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, trail running, fishing, and fly fishing and is best used from May until October.",
  "length": "4.4 mi",
  "elevationGain": "1,243 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Willow Lake Trail",
  "allTrailsURI": "/trail/us/utah/willow-lake-trail",
  "overview": "Willow Lake Trail is a 2.2 mile heavily trafficked loop trail located near Salt Lake City, Utah that features a lake and is rated as moderate. The trail offers a number of activity options and is accessible year-round.",
  "length": "2.2 mi",
  "elevationGain": "636 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Salt Lake Overlook via Desolation Trail",
  "allTrailsURI": "/trail/us/utah/salt-lake-overlook-via-desolation-trail",
  "overview": "Salt Lake Overlook via Desolation Trail [CLOSED] is a 4.8 mile heavily trafficked out and back trail located near Salt Lake City, Utah that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking and is best used from May until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.8 mi",
  "elevationGain": "1,299 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lake Desolation Mill D North Trail",
  "allTrailsURI": "/trail/us/utah/lake-desolation-mill-d-north-trail",
  "overview": "Lake Desolation Mill D North Trail is a 7.7 mile heavily trafficked out and back trail located near Salt Lake City, Utah that features a river and is rated as moderate. The trail offers a number of activity options and is best used from May until October.",
  "length": "7.7 mi",
  "elevationGain": "1,988 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Ensign Peak Trail and Overlook",
  "allTrailsURI": "/trail/us/utah/ensign-peak-trail-and-overlook",
  "overview": "Ensign Peak Trail and Overlook is a 0.8 mile heavily trafficked out and back trail located near Salt Lake City, Utah that offers scenic views and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "0.8 mi",
  "elevationGain": "374 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Twin Lakes Trail",
  "allTrailsURI": "/trail/us/utah/twin-lakes",
  "overview": "Twin Lakes Trail is a 2.3 mile heavily trafficked out and back trail located near Salt Lake City, Utah that features a lake and is rated as moderate. The trail offers a number of activity options and is best used from May until October.",
  "length": "2.3 mi",
  "elevationGain": "767 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Rattlesnake Gulch Trail",
  "allTrailsURI": "/trail/us/utah/rattlesnake-gulch-trail",
  "overview": "Rattlesnake Gulch Trail is a 3.3 mile heavily trafficked out and back trail located near Salt Lake City, Utah that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail.",
  "length": "3.3 mi",
  "elevationGain": "816 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Avenue Twin Peaks",
  "allTrailsURI": "/trail/us/utah/avenue-twin-peaks",
  "overview": "Avenue Twin Peaks is a 3.6 mile heavily trafficked out and back trail located near Salt Lake City, Utah that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.6 mi",
  "elevationGain": "984 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Broads Fork Trail",
  "allTrailsURI": "/trail/us/utah/broads-fork-trail",
  "overview": "Broads Fork Trail is a 4.9 mile heavily trafficked out and back trail located near Salt Lake City, Utah that features a waterfall and is rated as difficult. The trail offers a number of activity options and is accessible year-round.",
  "length": "4.9 mi",
  "elevationGain": "2,116 ft",
  "routeType": "Out & Back",
  "difficulty": "hard",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Sunset Peak Trail",
  "allTrailsURI": "/trail/us/utah/sunset-peak-trail",
  "overview": "Sunset Peak Trail is a 4.1 mile heavily trafficked out and back trail located near Salt Lake City, Utah that features a lake and is rated as moderate. The trail offers a number of activity options and is accessible year-round.",
  "length": "4.1 mi",
  "elevationGain": "1,358 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Dog Lake via Big Water Trail",
  "allTrailsURI": "/trail/us/utah/dog-lake-via-big-water-trail",
  "overview": "Dog Lake via Big Water Trail is a 5.2 mile heavily trafficked out and back trail located near Salt Lake City, Utah that features a lake and is rated as moderate. The trail offers a number of activity options and is best used from July until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "5.2 mi",
  "elevationGain": "1,276 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Ferguson Canyon Trail to Upper Meadow",
  "allTrailsURI": "/trail/us/utah/ferguson-canyon-trail-to-upper-meadow",
  "overview": "Ferguson Canyon Trail to Upper Meadow is a 4.3 mile heavily trafficked out and back trail located near Salt Lake City, Utah that features a river and is rated as difficult. The trail offers a number of activity options and is best used from April until November. Dogs are also able to use this trail.",
  "length": "4.3 mi",
  "elevationGain": "2,303 ft",
  "routeType": "Out & Back",
  "difficulty": "hard",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Dog Lake Mill D North Fork Trail",
  "allTrailsURI": "/trail/us/utah/dog-lake-mill-d-north-fork-trail",
  "overview": "Dog Lake Mill D North Fork Trail is a 4.7 mile out and back trail located near Salt Lake City, Utah that features a lake and is rated as moderate. The trail is primarily used for hiking, running, and snowshoeing and is best used from June until October.",
  "length": "4.7 mi",
  "elevationGain": "1,453 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mount Aire Trail",
  "allTrailsURI": "/trail/us/utah/mount-aire-trail",
  "overview": "Mount Aire Trail is a 3.8 mile heavily trafficked out and back trail located near Salt Lake City, Utah that features beautiful wild flowers and is rated as difficult. The trail offers a number of activity options and is best used from July until November. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.8 mi",
  "elevationGain": "1,961 ft",
  "routeType": "Out & Back",
  "difficulty": "hard",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Jacks Mountain",
  "allTrailsURI": "/trail/us/utah/jacks-mountain",
  "overview": "Jacks Mountain is a 2.4 mile heavily trafficked loop trail located near Salt Lake City, Utah that features beautiful wild flowers and is rated as difficult. The trail is primarily used for hiking, running, nature trips, and bird watching and is best used from April until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.4 mi",
  "elevationGain": "1,338 ft",
  "routeType": "Loop",
  "difficulty": "hard",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lake Solitude Trail",
  "allTrailsURI": "/trail/us/utah/lake-solitude-trail",
  "overview": "Lake Solitude Trail is a 3.3 mile heavily trafficked out and back trail located near Salt Lake City, Utah that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is accessible year-round.",
  "length": "3.3 mi",
  "elevationGain": "495 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Grandeur Peak Trail West Face",
  "allTrailsURI": "/trail/us/utah/grandeur-peak-trail-west-face",
  "overview": "Grandeur Peak Trail (West Face) is a 4.4 mile heavily trafficked loop trail located near Salt Lake City, Utah that features beautiful wild flowers and is only recommended for very experienced adventurers. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.4 mi",
  "elevationGain": "3,238 ft",
  "routeType": "Loop",
  "difficulty": "hard",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Dog Lake via Brighton Lakes Trail",
  "allTrailsURI": "/trail/us/utah/dog-lake-via-brighton-lakes-trail",
  "overview": "Dog Lake via Brighton Lakes Trail is a 2.2 mile moderately trafficked out and back trail located near Salt Lake City, Utah that features a lake and is good for all skill levels. The trail is primarily used for hiking, nature trips, and bird watching and is best used from May until September.",
  "length": "2.2 mi",
  "elevationGain": "639 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Brighton Lakes Loop",
  "allTrailsURI": "/trail/us/utah/brighton-lakes-loop",
  "overview": "Brighton Lakes Loop is a 7 mile heavily trafficked loop trail located near Salt Lake City, Utah that features a lake and is rated as difficult. The trail offers a number of activity options and is best used from July until October.",
  "length": "7.0 mi",
  "elevationGain": "1,807 ft",
  "routeType": "Loop",
  "difficulty": "hard",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "The Living Room Loop",
  "allTrailsURI": "/trail/us/utah/the-living-room-loop",
  "overview": "The Living Room Loop is a 2.8 mile moderately trafficked loop trail located near Salt Lake City, Utah that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, running, nature trips, and bird watching and is best used from March until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.8 mi",
  "elevationGain": "1,003 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "City Creek Canyon to Boneville Shoreline",
  "allTrailsURI": "/trail/us/utah/city-creek-canyon-to-boneville-shoreline",
  "overview": "City Creek Canyon to Boneville Shoreline is a 2.3 mile loop trail located near Salt Lake City, Utah that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for hiking.",
  "length": "2.3 mi",
  "elevationGain": "597 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Pipeline Trail via Rattlesnake Gulch Trail",
  "allTrailsURI": "/trail/us/utah/pipeline-trail-via-rattlesnake-gulch-trail",
  "overview": "Pipeline Trail via Rattlesnake Gulch Trail is a 5.7 mile moderately trafficked out and back trail located near Salt Lake City, Utah that offers scenic views and is rated as moderate. The trail is primarily used for hiking, running, and nature trips and is best used from April until October.",
  "length": "5.7 mi",
  "elevationGain": "1,187 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Jupiter Peak and Shadow Lake Loop",
  "allTrailsURI": "/trail/us/utah/jupiter-peak-and-shadow-lake-loop",
  "overview": "Jupiter Peak and Shadow Lake Loop is a 7 mile heavily trafficked loop trail located near Salt Lake City, Utah that features a lake and is rated as moderate. The trail is primarily used for hiking and is best used from May until October.",
  "length": "7.0 mi",
  "elevationGain": "1,817 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Silver Mountain Mine via Silver Fork Trail",
  "allTrailsURI": "/trail/us/utah/silver-mountain-mine-via-silver-fork-trail",
  "overview": "Silver Mountain Mine via Silver Fork Trail is a 5.3 mile moderately trafficked out and back trail located near Salt Lake City, Utah that features a waterfall and is rated as moderate. The trail is primarily used for hiking, running, nature trips, and snowshoeing and is accessible year-round.",
  "length": "5.3 mi",
  "elevationGain": "1,988 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lookout Peak",
  "allTrailsURI": "/trail/us/utah/lookout-peak",
  "overview": "Lookout Peak is a 7.9 mile lightly trafficked out and back trail located near Salt Lake City, Utah that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is best used from May until October.",
  "length": "7.9 mi",
  "elevationGain": "2,811 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 13,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lands End Trail",
  "allTrailsURI": "/trail/us/california/lands-end-trail",
  "overview": "Lands End Trail is a 3.4 mile heavily trafficked loop trail located near San Francisco, California that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, walking, running, and nature trips and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.4 mi",
  "elevationGain": "538 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Walk Across the Golden Gate Bridge",
  "allTrailsURI": "/trail/us/california/walk-across-the-golden-gate-bridge",
  "overview": "Walk Across the Golden Gate Bridge is a 3.7 mile heavily trafficked out and back trail located near San Francisco, California that offers the chance to see wildlife and is good for all skill levels. The trail offers a number of activity options and is accessible year-round.",
  "length": "3.7 mi",
  "elevationGain": "193 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mount Sutro Loop",
  "allTrailsURI": "/trail/us/california/mount-sutro-loop",
  "overview": "Mount Sutro Loop is a 2 mile heavily trafficked loop trail located near San Francisco, California that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.0 mi",
  "elevationGain": "495 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Batteries to Bluffs Trail",
  "allTrailsURI": "/trail/us/california/batteries-to-bluffs-trail",
  "overview": "Batteries to Bluffs Trail is a 2.2 mile heavily trafficked loop trail located near San Francisco, California that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round.",
  "length": "2.2 mi",
  "elevationGain": "449 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "California Coastal Trail Lands End to Golden Gate Bridge",
  "allTrailsURI": "/trail/us/california/california-coastal-trail-lands-end-to-golden-gate-bridge",
  "overview": "California Coastal Trail: Lands End to Golden Gate Bridge is a 4.4 mile heavily trafficked point-to-point trail located near San Francisco, California that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, walking, and running and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.4 mi",
  "elevationGain": "659 ft",
  "routeType": "Point to Point",
  "difficulty": "moderate",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Fort Funston Trail",
  "allTrailsURI": "/trail/us/california/fort-funston-trail",
  "overview": "Fort Funston Trail is a 2 mile heavily trafficked loop trail located near San Francisco, California that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for hiking, walking, nature trips, and bird watching and is accessible year-round. Dogs are also able to use this trail.",
  "length": "2.0 mi",
  "elevationGain": "160 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Seal Rocks Beach",
  "allTrailsURI": "/trail/us/california/seal-rocks-beach",
  "overview": "Seal Rocks Beach is a 2.3 mile heavily trafficked out and back trail located near San Francisco, California that offers the chance to see wildlife and is rated as moderate. The trail is primarily used for hiking, walking, nature trips, and bird watching and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.3 mi",
  "elevationGain": "390 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Presidio Loop Trail",
  "allTrailsURI": "/trail/us/california/presidio-loop-trail",
  "overview": "Presidio Loop Trail is a 6.1 mile heavily trafficked loop trail located near San Francisco, California that features beautiful wild flowers and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "6.1 mi",
  "elevationGain": "777 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Golden Gate Park Loop",
  "allTrailsURI": "/trail/us/california/golden-gate-park-trail",
  "overview": "Golden Gate Park Loop is a 6.3 mile heavily trafficked loop trail located near San Francisco, California that features a lake and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "6.3 mi",
  "elevationGain": "347 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Glen Canyon to Twin Peaks",
  "allTrailsURI": "/trail/us/california/glen-canyon-to-twin-peaks",
  "overview": "Glen Canyon to Twin Peaks is a 3.8 mile moderately trafficked loop trail located near San Francisco, California that features beautiful wild flowers and is rated as moderate. The trail is primarily used for hiking, running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.8 mi",
  "elevationGain": "725 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mount Davidson",
  "allTrailsURI": "/trail/us/california/mount-davidson",
  "overview": "Mount Davidson is a 1 mile heavily trafficked loop trail located near San Francisco, California that offers scenic views and is good for all skill levels. The trail is primarily used for walking and running and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.0 mi",
  "elevationGain": "246 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Glen Canyon Park",
  "allTrailsURI": "/trail/us/california/glen-canyon-park-trail",
  "overview": "Glen Canyon Park is a 1.8 mile heavily trafficked loop trail located near San Francisco, California that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for hiking, walking, running, and nature trips and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.8 mi",
  "elevationGain": "305 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Stow Lake and Strawberry Hill Loop",
  "allTrailsURI": "/trail/us/california/stow-lake-and-strawberry-hill-loop",
  "overview": "Stow Lake and Strawberry Hill Loop is a 2 mile heavily trafficked loop trail located near San Francisco, California that features a lake and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.0 mi",
  "elevationGain": "154 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Golden Gate Bridge from Baker Beach Trail",
  "allTrailsURI": "/trail/us/california/golden-gate-bridge-from-baker-beach-trail",
  "overview": "Golden Gate Bridge from Baker Beach Trail is a 5.9 mile heavily trafficked out and back trail located near San Francisco, California that offers scenic views and is rated as moderate. The trail offers a number of activity options and is accessible year-round.",
  "length": "5.9 mi",
  "elevationGain": "685 ft",
  "routeType": "Out & Back",
  "difficulty": "moderate",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "San Francisco Crosstown Trail",
  "allTrailsURI": "/trail/us/california/san-francisco-crosstown-trail",
  "overview": "San Francisco Crosstown Trail is a 17 mile heavily trafficked point-to-point trail located near San Francisco, California that features a lake and is rated as moderate. The trail is primarily used for hiking and running and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "17.0 mi",
  "elevationGain": "1,955 ft",
  "routeType": "Point to Point",
  "difficulty": "moderate",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Philosopher s Way",
  "allTrailsURI": "/trail/us/california/philosophers-way",
  "overview": "Philosopher's Way is a 2.7 mile moderately trafficked loop trail located near San Francisco, California that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for walking and running and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.7 mi",
  "elevationGain": "328 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lake Merced Trail",
  "allTrailsURI": "/trail/us/california/lake-merced-trail",
  "overview": "Lake Merced Trail is a 4.5 mile heavily trafficked loop trail located near San Francisco, California that offers the chance to see wildlife and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail.",
  "length": "4.5 mi",
  "elevationGain": "127 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Fort Point Baker Beach Coast Trail",
  "allTrailsURI": "/trail/us/california/fort-point-baker-beach-coast-trail",
  "overview": "Fort Point - Baker Beach Coast Trail is a 3.9 mile heavily trafficked out and back trail located near San Francisco, California and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.9 mi",
  "elevationGain": "793 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Presidio Promenade Trail",
  "allTrailsURI": "/trail/us/california/presidio-promenade-trail",
  "overview": "Presidio Promenade Trail is a 4.5 mile heavily trafficked loop trail located near San Francisco, California that features a great forest setting and is rated as moderate. The trail offers a number of activity options. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.5 mi",
  "elevationGain": "423 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Crissy Field and the Palace of Fine Arts",
  "allTrailsURI": "/trail/us/california/crissy-field-and-the-palace-of-fine-arts",
  "overview": "Crissy Field and the Palace of Fine Arts is a 3.9 mile heavily trafficked loop trail located near San Francisco, California that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail.",
  "length": "3.9 mi",
  "elevationGain": "32 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mount Sutro to Twin Peaks",
  "allTrailsURI": "/trail/us/california/mount-sutro-to-twin-peak",
  "overview": "Mount Sutro to Twin Peaks is a 4.1 mile moderately trafficked loop trail located near San Francisco, California that offers the chance to see wildlife. The trail is rated as moderate and is primarily used for hiking, running, nature trips, and bird watching. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.1 mi",
  "elevationGain": "1,010 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Ecology Trail and Lovers Lane Loop",
  "allTrailsURI": "/trail/us/california/ecology-trail-and-lovers-lane-loop",
  "overview": "Ecology Trail and Lovers' Lane Loop is a 2 mile moderately trafficked loop trail located near San Francisco, California that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for walking, running, and nature trips and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.0 mi",
  "elevationGain": "295 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Moraga Steps",
  "allTrailsURI": "/trail/us/california/moraga-steps",
  "overview": "Moraga Steps is a 0.1 mile lightly trafficked out and back trail located near San Francisco, California that offers scenic views and is good for all skill levels. The trail is primarily used for walking and running and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "0.1 mi",
  "elevationGain": "42 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Bernal Heights Park Trail",
  "allTrailsURI": "/trail/us/california/bernal-heights-park-trail",
  "overview": "Bernal Heights Park Trail is a 1 mile moderately trafficked loop trail located near San Francisco, California that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail.",
  "length": "1.0 mi",
  "elevationGain": "108 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 14,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Discovery Park and Lighthouse Loop Trail",
  "allTrailsURI": "/trail/us/washington/discovery-park-and-lighthouse-loop-trail",
  "overview": "Discovery Park and Lighthouse Loop Trail is a 4.4 mile heavily trafficked loop trail located near Seattle, Washington that offers the chance to see wildlife and is good for all skill levels. The trail offers a number of activity options and is best used from May until December. Dogs are also able to use this trail but must be kept on leash.",
  "length": "4.4 mi",
  "elevationGain": "472 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Green Lake Trail",
  "allTrailsURI": "/trail/us/washington/green-lake-loop-trail",
  "overview": "Green Lake Trail is a 2.8 mile heavily trafficked loop trail located near Seattle, Washington that features a lake and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.8 mi",
  "elevationGain": "29 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "The Washington Park Arboretum",
  "allTrailsURI": "/trail/us/washington/the-washington-park-arboretum",
  "overview": "The Washington Park Arboretum is a 3.5 mile heavily trafficked loop trail located near Seattle, Washington that features a lake and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.5 mi",
  "elevationGain": "203 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Seward Park Perimeter Loop",
  "allTrailsURI": "/trail/us/washington/seward-park-perimeter-loop",
  "overview": "Seward Park Perimeter Loop is a 2.6 mile heavily trafficked loop trail located near Seattle, Washington that features a lake and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.6 mi",
  "elevationGain": "65 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Cable Line Trail to West Tiger",
  "allTrailsURI": "/trail/us/washington/cable-line-trail-to-west-tiger-3",
  "overview": "Cable Line Trail to West Tiger #3 is a 3 mile heavily trafficked out and back trail located near Seattle, Washington that features a great forest setting and is rated as difficult. The trail is primarily used for hiking, walking, running, and nature trips and is best used from April until October.",
  "length": "3.0 mi",
  "elevationGain": "2,001 ft",
  "routeType": "Out & Back",
  "difficulty": "hard",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Kubota Garden Natural Area Trails",
  "allTrailsURI": "/trail/us/washington/kubota-garden-natural-area-trails",
  "overview": "Kubota Garden Natural Area Trails is a 0.8 mile moderately trafficked out and back trail located near Seattle, Washington that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "0.8 mi",
  "elevationGain": "55 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lincoln Park Trail",
  "allTrailsURI": "/trail/us/washington/lincoln-park-trail",
  "overview": "Lincoln Park Trail is a 1.4 mile heavily trafficked loop trail located near Seattle, Washington that offers the chance to see wildlife and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.4 mi",
  "elevationGain": "118 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Burke Gilman Trail Ballard Bridge to Bothell",
  "allTrailsURI": "/trail/us/washington/burke-gilman-trail-ballard-bridge-to-bothell",
  "overview": "Burke-Gilman Trail: Ballard Bridge to Bothell is a 18.3 mile heavily trafficked point-to-point trail located near Seattle, Washington that features a lake and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "18.3 mi",
  "elevationGain": "393 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "South Beach Trail",
  "allTrailsURI": "/trail/us/washington/south-beach-trail",
  "overview": "South Beach Trail is a 1.5 mile heavily trafficked out and back trail located near Seattle, Washington that offers scenic views and is good for all skill levels. The trail is primarily used for hiking, walking, nature trips, and bird watching and is best used from April until September.",
  "length": "1.5 mi",
  "elevationGain": "282 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Saltwater State Park Loop",
  "allTrailsURI": "/trail/us/washington/saltwater-state-park",
  "overview": "Saltwater State Park Loop is a 1.4 mile moderately trafficked loop trail located near Seattle, Washington that features a great forest setting and is good for all skill levels. The trail is primarily used for hiking, walking, running, and camping and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.4 mi",
  "elevationGain": "127 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Normandy Beach Trail",
  "allTrailsURI": "/trail/us/washington/normandy-beach-trail",
  "overview": "Normandy Beach Trail is a 1.1 mile moderately trafficked loop trail located near Seattle, Washington that features beautiful wild flowers and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail.",
  "length": "1.1 mi",
  "elevationGain": "252 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Myrtle Edwards Park to Elliott Bay Park",
  "allTrailsURI": "/trail/us/washington/myrtle-edwards-park-to-elliott-bay-park",
  "overview": "Myrtle Edwards Park to Elliott Bay Park is a 3.5 mile moderately trafficked out and back trail located near Seattle, Washington that offers the chance to see wildlife and is good for all skill levels. The trail offers a number of activity options. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.5 mi",
  "elevationGain": "59 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Carkeek Park via Pipers Creek Trail",
  "allTrailsURI": "/trail/us/washington/carkeek-park-via-pipers-creek-trail",
  "overview": "Carkeek Park via Pipers Creek Trail is a 3.2 mile moderately trafficked loop trail located near Seattle, Washington that features a lake and is good for all skill levels. The trail offers a number of activity options. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.2 mi",
  "elevationGain": "633 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Foster Island Trail",
  "allTrailsURI": "/trail/us/washington/foster-island-trail",
  "overview": "Foster Island Trail is a 3.3 mile heavily trafficked out and back trail located near Seattle, Washington that features a lake and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "3.3 mi",
  "elevationGain": "101 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Loop Trail via West Emerson Street Entrance",
  "allTrailsURI": "/trail/us/washington/loop-trail-via-west-emerson-street-entrance",
  "overview": "Loop Trail via West Emerson Street Entrance is a 2.8 mile heavily trafficked loop trail located near Seattle, Washington that offers the chance to see wildlife. The trail is good for all skill levels and is primarily used for hiking, running, and nature trips. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.8 mi",
  "elevationGain": "219 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Lake Union Loop",
  "allTrailsURI": "/trail/us/washington/lake-union-loop",
  "overview": "Lake Union Loop is a 6.4 mile heavily trafficked loop trail located near Seattle, Washington that offers scenic views and is good for all skill levels. The trail is primarily used for walking, running, and road biking. Dogs are also able to use this trail but must be kept on leash.",
  "length": "6.4 mi",
  "elevationGain": "193 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Seattle Waterfront Pathway",
  "allTrailsURI": "/trail/us/washington/seattle-waterfront-pathway",
  "overview": "Seattle Waterfront Pathway is a 8.5 mile out and back trail located near Seattle, Washington that offers scenic views and is good for all skill levels. The trail is primarily used for walking and trail running and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "8.5 mi",
  "elevationGain": "127 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Shoreview and Boeing Creek Loop",
  "allTrailsURI": "/trail/us/washington/shoreview-and-boeing-creek-loop",
  "overview": "Shoreview and Boeing Creek Loop is a 1.5 mile moderately trafficked loop trail located near Seattle, Washington that features a lake and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.5 mi",
  "elevationGain": "154 ft",
  "routeType": "Loop",
  "difficulty": "moderate",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "South Bluff South Ridge Piper s Creek North Traverse and Grand Fire Trail",
  "allTrailsURI": "/trail/us/washington/south-bluff-south-ridge-piper-s-creek-north-traverse-and-grand-fire-trail",
  "overview": "South Bluff, South Ridge, Piper's Creek, North Traverse and Grand Fire Trail is a 1.9 mile heavily trafficked out and back trail located near Seattle, Washington that features a lake and is good for all skill levels. The trail is primarily used for hiking, walking, running, and nature trips and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.9 mi",
  "elevationGain": "367 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Seahurst Park Loop Trail",
  "allTrailsURI": "/trail/us/washington/seahurst-park",
  "overview": "Seahurst Park Loop Trail is a 1.8 mile moderately trafficked loop trail located near Seattle, Washington that features a great forest setting and is good for all skill levels. The trail is primarily used for hiking, walking, and running and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "1.8 mi",
  "elevationGain": "351 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "West Point Lighthouse to Discovery East Lot",
  "allTrailsURI": "/trail/us/washington/westpoint-lighthouse-to-discovery-east-lot",
  "overview": "West Point Lighthouse to Discovery East Lot is a 2.2 mile point-to-point trail located near Seattle, Washington that features beautiful wild flowers and is good for all skill levels. The trail is primarily used for hiking and walking.",
  "length": "2.2 mi",
  "elevationGain": "314 ft",
  "routeType": "Point to Point",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Pike Place Market",
  "allTrailsURI": "/trail/us/washington/pike-place-market--2",
  "overview": "Pike Place Market is a 0.5 mile heavily trafficked loop trail located near Seattle, Washington that offers scenic views and is good for all skill levels. The trail is primarily used for walking and is accessible year-round.",
  "length": "0.5 mi",
  "elevationGain": "45 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Magnuson Park Waterfront Trail",
  "allTrailsURI": "/trail/us/washington/magnuson-and-ravenna-parks",
  "overview": "Magnuson Park Waterfront Trail is a 2.8 mile heavily trafficked loop trail located near Seattle, Washington that features a lake and is good for all skill levels. The trail offers a number of activity options and is best used from March until October. Dogs are also able to use this trail.",
  "length": "2.8 mi",
  "elevationGain": "45 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Swamp Ruths Kees Big Tree and Bus Trail Loop",
  "allTrailsURI": "/trail/us/washington/ruths-big-tree-trail-to-bus-trail-loop",
  "overview": "Swamp, Ruths Kees Big Tree and Bus Trail Loop is a 2.9 mile moderately trafficked loop trail located near Seattle, Washington that features a lake and is good for all skill levels. The trail is primarily used for hiking, walking, running, and nature trips and is best used from March until October. Dogs are also able to use this trail but must be kept on leash.",
  "length": "2.9 mi",
  "elevationGain": "255 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Broken Tree Trail",
  "allTrailsURI": "/trail/us/washington/broken-tree-trail",
  "overview": "Broken Tree Trail is a 0.6 mile moderately trafficked out and back trail located near Seattle, Washington that features a great forest setting and is good for all skill levels. The trail is primarily used for hiking, walking, nature trips, and bird watching and is best used from April until September. Dogs are also able to use this trail but must be kept on leash.",
  "length": "0.6 mi",
  "elevationGain": "55 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Mathison Park Loop",
  "allTrailsURI": "/trail/us/washington/mathison-park-loop",
  "overview": "Mathison Park Loop is a 0.4 mile moderately trafficked loop trail located near Seattle, Washington that features a great forest setting and is good for all skill levels. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash.",
  "length": "0.4 mi",
  "elevationGain": "82 ft",
  "routeType": "Loop",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}, {
  "name": "Waterside Path CLOSED",
  "allTrailsURI": "/trail/us/washington/eagle-creek-landing",
  "overview": "Waterside Path  [CLOSED] is a 1.7 mile lightly trafficked out and back trail located near Seattle, Washington that features a river and is good for all skill levels. The trail is primarily used for walking, running, and nature trips.",
  "length": "1.7 mi",
  "elevationGain": "295 ft",
  "routeType": "Out & Back",
  "difficulty": "easy",
  "cityId": 15,
  "createdAt": "new Date()",
  "updatedAt": "new Date()"
}]
